[
  {
    "applicationDeadline": "4 Jul 2025 11:55 PM",
    "companyLogo": "https://logowik.com/content/uploads/images/930_unicef.jpg",
    "companyName": "UNICEF",
    "datePosted": "13 Jun 2025",
    "jobType": "Consultant",
    "link": "https://jobs.unicef.org/en-us/job/581759/consultancy-prefeasibility-study-to-set-up-a-groundwater-access-facility-gafa-wcaro-dakar-senegal-5-months-40-effective-days",
    "location": "Senegal",
    "position": "Consultancy Pre-feasibility study to set up a Groundwater Access Facility GAFA WCARO Dakar Senegal 5 months 40 effective days",
    "scrapedAt": "2025-06-16T10:13:08.066Z",
    "source": "unicef-careers",
    "jobDescription": "UNICEF works in some of the world’s toughest places, to reach the world’s most disadvantaged children. To save their lives. To defend their rights. To help them fulfill their potential. \nAcross 190 countries and territories, we work for every child, everywhere, every day, to build a better world for everyone. \nAnd we never give up. \nFor every child, hope\nJob organizational context: UNICEF’s West and Central Africa Regional Office (WCARO) based in Dakar, Senegal, is looking for a Pre- feasibility study and development of a road map to setup a groundwater access facility (GAFA) in the Sahel Region. Focusing on investment, data management, governance, and capacity strengthening and identification of up to 50 project pipelines.\nHow can you make a difference? \nPurpose for the job: The consultancy will appraise the relevance for the setup and implementation of the GAFA initiative in the Sahel region. It will focus on the three objectives below:\n\nIdentification of potential aquifers for GAFA implementation: preliminary overview and comprehensive assessment of (transboundary) aquifers in the Sahel. Inventory and mapping of aquifers and hydrogeological characteristics, groundwater utilization and demand analysis (irrigation, drinking water, industry, ecosystem support) based on water demand trends, stakeholders’ analysis (including the private sector), ongoing initiatives, governance mechanisms, map existing groundwater infrastructures and investment projects. This phase will also set the main criteria needed to harness groundwater resources in an environmentally sustainable manner and what constitute a set of critical complementary interventions required to ensure the sound and effective utilization of groundwater resources and their replenishment. The consultant will provide clear recommendations on where to start the GAFA initiative, based on situation analysis, complementarity with other initiatives, stakeholders’ analysis, potential for success, risks, potential interest of donors…\n\n \n\nFeasibility Study and recommendations (SWOT Analysis). For the two most relevant aquifer zones identified in #1, conduct a pre-feasibility study for the implementation of the GAFA initiative, including a comprehensive SWOT analysis to evaluate the strengths, weaknesses, opportunities, and threats related to the establishment of the facility, a more in-depth stakeholder analysis and consultation. The review and consultations will also focus and build upon existing good practices in ground water resources management for domestic, agricultural and economic purposes, including aspects of water and land governance, regulatory aspects, local agreements and environmental and social safeguards. Develop a Theory of Change to demonstrate the relevance and impact of the GAFA Initiative.\n\n \n\nPre-identification of a robust governance framework for the operationalization of the GAFA initiative. Pre-identify the institutional anchoring of the GAFA and governance structure to ensure its sustainable management; formulate strategic and programmatic recommendations, including criteria for sustainable and climate and environmental resilience management of groundwater resources. Documented evidence, engagement and consultation with research organizations and academia in the Sahel is key to inform the pre-identification of ground water resources utilization framework for action and related strategies. The potential academic partners to support the implementation of GAFA will be identified.\n\n \nThe study will provide recommendations for the GAFA initiative enabling the Technical Working Group (CILSS, UNICEF, UNESCO, UNDP, FAO, WFP and potential additional members) to decide on the pertinency of the initiative and to engage in Phase 2.\n \n \n \nTo qualify as an advocate for every child you will have… \nMinimum requirements:\nEducation: Advanced university degree or equivalent experience in Civil / Water / Environmental Engineering.\n  \nWork experience: \n\nA minimum of 15 years ‘experience in designing water investments in sub-Saharan Africa.\nA minimum 10 years’ experience in underground water development.\nExperience with multi use of water for land restoration and agriculture, livestock, industry, domestic purposes.\nExperience in the development of vulnerability assessments, feasibility studies, and defining development investment ready projects for aquifer systems.\n\n \nSkills:\n\n Ability to conduct consultations with regional institutions, governments, and facilitation of meetings.\n\n \nLanguage requirements:\n \n\nFluency in English and French are required. Knowledge of another official UN language (Arabic, Chinese, French, Russian or Spanish) or a local language is an asset. \n\nFor every Child, you demonstrate… \nUNICEF's values of Care, Respect, Integrity, Trust, Accountability, and Sustainability (CRITAS). \n  \nTo view our competency framework, please visit  here. \nUNICEF is committed to diversity and inclusion within its workforce, and encourages all candidates, irrespective of gender, nationality, religious or ethnic background, and persons with disabilities, to apply to become a part of the organization. To create a more inclusive workplace, UNICEF offers paid parental leave, breastfeeding breaks, and reasonable accommodation for persons with disabilities. UNICEF strongly encourages the use of flexible working arrangements. Click here to learn more about flexible work arrangements, well-being, and benefits.\nAccording to the UN Convention on the Rights of Persons with Disabilities (UNCRPD), persons with disabilities include those who have long-term physical, mental, intellectual, or sensory impairments which, in interaction with various barriers, may hinder their full and effective participation in society on an equal basis with others. In its Disability Inclusion Policy and Strategy 2022-2030, UNICEF has committed to increase the number of employees with disabilities by 2030. At UNICEF, we provide reasonable accommodation for work-related support requirements of candidates and employees with disabilities. Also, UNICEF has launched a Global Accessibility Helpdesk to strengthen physical and digital accessibility. If you are an applicant with a disability who needs digital accessibility support in completing the online application, please submit your request through the accessibility email button on the UNICEF Careers webpage Accessibility | UNICEF.\nUNICEF does not hire candidates who are married to children (persons under 18). UNICEF has a zero-tolerance policy on conduct that is incompatible with the aims and objectives of the United Nations and UNICEF, including sexual exploitation and abuse, sexual harassment, abuse of authority and discrimination based on gender, nationality, age, race, sexual orientation, religious or ethnic background or disabilities. UNICEF is committed to promote the protection and safeguarding of all children. All selected candidates will, therefore, undergo rigorous reference and background checks, and will be expected to adhere to these standards and principles. Background checks will include the verification of academic credential(s) and employment history. Selected candidates may be required to provide additional information to conduct a background check, and selected candidates with disabilities may be requested to submit supporting documentation in relation to their disability confidentially.\nRemarks:  \nOnly shortlisted candidates will be contacted and advance to the next stage of the selection process. \nIndividuals engaged under a consultancy or individual contract will not be considered “staff members” under the Staff Regulations and Rules of the United Nations and UNICEF’s policies and procedures, and will not be entitled to benefits provided therein (such as leave entitlements and medical insurance coverage). Their conditions of service will be governed by their contract and the General Conditions of Contracts for the Services of Consultants and Individual Contractors. Consultants and individual contractors are responsible for determining their tax liabilities and for the payment of any taxes and/or duties, in accordance with local or other applicable laws. \nThe selected candidate is solely responsible to ensure that the visa (applicable) and health insurance required to perform the duties of the contract are valid for the entire period of the contract. Selected candidates are subject to confirmation of fully-vaccinated status against SARS-CoV-2 (Covid-19) with a World Health Organization (WHO)-endorsed vaccine, which must be met prior to taking up the assignment. It does not apply to consultants who will work remotely and are not expected to work on or visit UNICEF premises, programme delivery locations or directly interact with communities UNICEF works with, nor to travel to perform functions for UNICEF for the duration of their consultancy contracts."
  }
]