[
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://i0.wp.com/careersmw.com/wp-content/uploads/2024/11/VSO-Malawi.jpeg?resize=150%2C150&ssl=1",
    "companyName": "VSO Malawi",
    "datePosted": "2025-06-16",
    "isValidUrl": true,
    "jobType": "Fixed Contract",
    "link": "https://careersmw.com/job/189352/",
    "location": "Malawi",
    "position": "Office Assistant VSO Malawi",
    "scrapedAt": "2025-06-16T13:57:37.696Z",
    "source": "careersmw",
    "jobDescription": "Role Overview Summary\nTo provide general cleanliness of the office\n\n\nIdeal Applicant Summary\nCompetencies and Behaviour\nAt VSO we believe progress is only possible by working together. Whether you want to join us as an employee, or as a volunteer working in your own country, overseas or online, our selection process includes an assessment based on these core competencies:\n• Ability to be open minded and respectful\n• Ability to be resilient and adaptive to new situations\n• Ability to facilitate positive change and build sustainable working relationships\n• Ability to seek and share knowledge\nEqual Opportunities\nVSO promotes equal opportunities and values a diverse workforce\nEqual Opportunities: VSO promotes equal opportunities and values a diverse workforce.\nVSO reserves the right to close this job early if we receive a sufficient number of applications.\nApply Now"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://i0.wp.com/opportunitiesforyouth.org/wp-content/uploads/2025/06/Untitled-design-1.png?resize=440%2C264&ssl=1",
    "companyName": "N/A",
    "datePosted": "2025-06-15",
    "isValidUrl": true,
    "jobType": "",
    "link": "https://opportunitiesforyouth.org/2025/06/16/shape-the-future-challenge-2025-turn-your-climate-solution-into-reality/",
    "location": "Africa",
    "position": "Shape the Future Challenge 2025 Turn Your Climate Solution Into Reality",
    "scrapedAt": "2025-06-16T13:58:36.567Z",
    "source": "opportunitiesforyouth",
    "jobDescription": "Spread the loveAre you a young changemaker between 15 and 24 years old with a bold idea to tackle climate change? Are you ready to collaborate with passionate peers, learn from world-class mentors, and take your solution to a global stage? The Shape the Future Challenge 2025, powered by Moonshot Pirates, is your opportunity to turn your vision into action—and even win an unforgettable innovation trip to Dubai!\nThis is more than a challenge—it’s a launchpad for the next generation of climate innovators.\n\nAbout the Shape the Future Challenge\nThe Shape the Future Challenge is a global online innovation competition that empowers youth aged 15 to 24 to develop bold, impactful, and sustainable solutions for the climate crisis. Over four exciting weeks, you’ll:\n\n\nForm international teams\n\n\nLearn from global experts and mentors\n\n\nDevelop and pitch your climate solution\n\n\nCompete for a trip to Dubai, where you’ll explore the heart of global innovation and sustainability\n\n\nThis year’s focus is Climate Action, in line with the UN’s Sustainable Development Goals (SDGs).\n\nWhy Join?\n\n\nLearn critical 21st-century skills: Ideation, design thinking, storytelling, entrepreneurship, and sustainability.\n\n\nGain mentorship from top professionals: Tech founders, climate scientists, business leaders, and more.\n\n\nCollaborate across borders: Team up with peers from around the world and work toward a shared goal.\n\n\nAmplify your voice and ideas: Present your project in front of a global audience, including impact-driven organizations.\n\n\nWin the experience of a lifetime: An all-expenses-covered trip to Dubai, including workshops, innovation tours, and connection with sustainability leaders.\n\n\n\nChallenge Timeline\nApply (June 6 – June 30, 2025)\n\n\nOpen to individuals and teams\n\n\nNo idea yet? No problem—you can still join and find teammates later.\n\n\nAll accepted participants will be invited to the Moonshot Pirates online challenge space by July 1.\n\n\nTeam Up (July 3 – July 6, 2025)\n\n\nAttend the Opening Ceremony on July 3\n\n\nParticipate in fun networking events to connect with changemakers\n\n\nForm your team of 2–6 members by July 6\n\n\nDevelop Your Idea (July 3 – July 31, 2025)\n\n\nDesign a radical, feasible, and impactful climate solution\n\n\nAttend expert mentoring sessions and workshops\n\n\nSubmit your final project and 1-minute pitch video by July 31 (3 PM UTC)\n\n\nFinal Pitching (August 4 – August 21, 2025)\n\n\n7 finalist teams will be selected through a combination of online voting and expert assessment\n\n\nFinalists present their pitch during the online Pitching Ceremony on August 21\n\n\nWinner receives an invitation to Dubai in early 2026\n\n\n\nWhat’s at Stake?\nGrand Prize: Dubai Innovation Trip (2026)\n\n\nReturn airfare from your nearest major international airport\n\n\nAccommodation and transportation in Dubai\n\n\nVisits to cutting-edge innovation hubs and green startups\n\n\nHands-on workshops and networking with climate pioneers\n\n\nBonus Opportunities:\n\n\nChance to pitch at Future Port Youth 2025 in Prague\n\n\nGlobal exposure, mentorship, and growth opportunities long after the challenge ends\n\n\n\nWho Can Apply?\n\n\nYouth aged 15–24, from any country\n\n\nFluent in English (the entire challenge is conducted in English)\n\n\nPassionate about solving real-world climate issues\n\n\nNo experience necessary—just a commitment to learn and collaborate\n\n\nParental consent is required for finalists under 18 years old.\n\nWhat Kind of Ideas Are We Looking For?\nYour project should address at least one UN Sustainable Development Goal (SDG), with a special focus on climate change. Here are a few examples of possible directions:\n\n\nClean energy innovations\n\n\nGreen transportation & mobility\n\n\nWaste reduction & circular economy\n\n\nFood security & sustainable agriculture\n\n\nSmart cities & sustainable housing\n\n\nProjects can be submitted as concepts or working prototypes. Judges will assess submissions based on:\n\n\nImpact\n\n\nRadicality\n\n\nFeasibility\n\n\nWow factor\n\n\n\n What Will You Learn?\nThe challenge provides educational videos, expert-led workshops, and mentoring sessions covering:\n\n\nHow to identify global challenges\n\n\nIdeation and brainstorming\n\n\nEffective storytelling and pitching\n\n\nTeam collaboration\n\n\nStrategic project planning\n\n\nHow to build sustainable business models\n\n\n Most activities take 20 min to 1.5 hours/day, designed to fit easily around school or work.\n\nMentoring & Support\nGet access to a global pool of mentors including:\n\n\nSustainability leaders\n\n\nEngineers and startup founders\n\n\nDesigners and technologists\n\n\nMarketing and fundraising experts\n\n\nTeams can book individual sessions with mentors and receive tailored feedback throughout the challenge.\n\nFAQs (Highlights)\n\n\nFree to join\n\n\nConducted entirely in English\n\n\nIndividual application required—even if applying as a team\n\n\nInternational teams encouraged\n\n\nLaptop and stable internet recommended\n\n\nYour idea remains yours—but may also be promoted by challenge partners\n\n\nCheck the full FAQ here.\n\n How to Apply\nReady to make your mark?\nApply here by June 30, 2025\nFor more opportunities, visit opportunitiesforyouth.org."
  }
]