[
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/05/Target-Security-150x150.png",
    "companyName": "Target Security Group",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/head-of-operations-10/",
    "location": "Blantyre",
    "position": "Head of Operations Target Security Group",
    "source": "jobsearchmalawi",
    "jobDescription": "Hiring!\nPOSITION: HEAD OF OPERATIONS.\nTarget Security, a fully integrated multidisciplinary security and facilities management company is recruiting the Head of Operations.\nReporting to the General Manager, the Head of Operations shall be responsible for operational efficiency, driving strategic initiatives and ensuring seamless day-to-day functions.\nThe candidate will support the regional operations and profitability through ensuring of the best possible business performance and contract delivery. The successful candidate will be based at our Blantyre office.\n He/she must possess a mind of steel capable of working under heavy pressure as this is a highly demanding job, and he/she will be reporting to very very difficult directors\nMain Responsibilities.\nDuties and essential functions but not limited to.\n\n\nLeading and overseeing the group’s security- operational functions.\n\n\nAttending to high level client- meetings.\n\nEffectively setting out goals and objectives for your department, including those for supervisory roles that may fall under your reporting line and structure.\nActing as a role model and always behaving in line with our company values.\nManaging contractual budgets in line with financial targets.\nEnsuring all aspects of the required security services are being delivered to the customers’ satisfaction and in accordance with the contract.\nEnsuring contract required training and screening / vetting has been completed for all security staff.\n\nQualifications\n\nBachelor’s degree in a related field from an accredited college or university.\n5+ years of experience relating to the above-described duties.\n\nYour profile.\n\n\nMinimum of 5 years in security management.\n\n\nHigher Diploma or equivalent in security management or related field.\n\n\nExcellent written and verbal communication skills.\n\n\nProficiency in Microsoft Office\n\n\nThose that have served in the Malawi Defence force or the Malawi Police Service have an added advantage.\n\nWillingness to work with futuristic and agile directors.\n\nPossession of a driver’s license is a MUST.\n\n\nSend applications to:\nThe Human Resources & Compliance Officer,\nTarget Security Group \n29 Kidney Crescent, Kristiwick\nP.O Box 3158\nBlantyre.\nE-mail: info@targeterp.com and wchiwaka@targeterp.com\nClosing date for receiving applications is Monday, 2nd June,2025.\nTarget Security Group is an equal opportunity employer."
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/05/Target-Security-150x150.png",
    "companyName": "Target Security Group",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/general-manager-53/",
    "location": "Blantyre",
    "position": "General Manager Target Security Group",
    "source": "jobsearchmalawi",
    "jobDescription": "Hiring!\nPOSITION: GENERAL MANAGER.\nTarget Security, a fully integrated multidisciplinary security and facilities management company is recruiting a General Manager.\nReporting to the Chief Executive Officer ,the General Manager shall be responsible for group operational efficiency, driving strategic initiatives and ensuring seamless day-to-day functions.\nThe candidate will be overseeing the management of the company. The successful candidate will be based at the Head Office, Blantyre.\nHe/she must possess a mind of steel capable of working under heavy pressure as this is a highly demanding job, and he/she will be reporting to very very difficult directors\nMain Responsibilities.\nDuties and essential functions but not limited to.\n\n\nStrategic planning and vision development.\n\n\nEffective people management and team leadership.\n\n\nCommercial and financial management.\n\n\nCustomer relationship management.\n\n\nPersonal resilience and strong leadership qualities.\n\n\nYour profile.\n\n\nMinimum of 10 years in security operations management.\n\n\nFirst degree or equivalent in security management or related field.\n\n\nExcellent written and verbal communication skills.\n\n\nProficiency in Microsoft Office\n\nWillingness to work with futuristic and agile directors.\nThose that have served in the Malawi Defence force or the Malawi Police Service will be considered.\n\n\n\nPossession of a driver’s license is a MUST.\n\n\nSend applications to:\nThe Human Resources & Compliance Officer,\nTarget Security Group \n29 Kidney Crescent, Kristiwick\nP.O Box 3158\nBlantyre.\nE-mail: info@targeterp.com and wchiwaka@targeterp.com\nClosing date for receiving applications is Monday, 2nd June,2024.\nTarget Security Group is an equal opportunity employer."
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2020/09/Malawi-Institute-of-Procurement-and-Supply-MIPS-150x150.jpg",
    "companyName": "Malawi Institute of Procurement and Supply MIPS",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/chief-executive-officer-80/",
    "location": "Lilongwe",
    "position": "Chief Executive Officer Malawi Institute of Procurement and Supply MIPS",
    "source": "jobsearchmalawi",
    "jobDescription": "CHIEF EXECUTIVE OFFICER\nMalawi Institute of Procurement and Supply (MIPS) is looking for a suitably qualified and experienced candidate to join a team of highly motivated and dedicated professionals at the Institute as Chief Executive Officer (CEO).\nTHE ORGANISATION\nThe Malawi Institute of Procurement and Supply (MIPS) is the regulatory body for the procurement and supply chain management profession in Malawi established under the Malawi Institute of Procurement and Supply Act No. 3 of 2016. The Institute is mandated to provide direct oversight over procurement professionals by, among others, promoting professional standards and practice among procurement and supply chain professionals; ensuring transparency, integrity, accountability and fairness on all matters of procurement in organizations; protecting the financial interest of the government, private sector and general public; maintaining annual registration and provide certificates of practice for all procurement and supply management professionals in Malawi and advising training institutions and training providers in matters relating to procurement professionalism.\nPOSITION OF CHIEF EXECUTIVE OFFICER\nIn order to fulfil its mandate effectively and efficiently, MIPS has the position of Chief Executive Officer (CEO), who is the head of its secretariat. The CEO is responsible for leading the development and execution of MIPS’s long-term strategy to create stakeholder value.\nThe Institute is therefore looking for a candidate to fill this position of CEO on a three-year contract renewable for a further term based on performance.\nQUALIFICATION AND EXPERIENCE\nThe ideal candidate must posses the following qualification and experience:\n\nMinimum of master’s degree in supply chain management or business administration from a recognized institution\n10 years’ experience work experience of which five (5) years should be at Senior Management level\nDemonstrable experience in strategic planning, organizational development, and policy development for at least five (5) years.\nMust be a member of the Malawi Institute of Procurement and Supply (MIPS)\nDemonstrated knowledge of the local and international procurement landscape\nStrong ability to organize effectively, delegate responsibly, solve problems quickly and communicate clearly.\nLeadership skills including the ability to manage time effectively, and handle both internal and external conflicts\n\nKEY COMPETENCIES\nThe ideal candidate must possess the following:\n\nHave deep technical knowledge and understanding of the Malawi Institute of Procurement and Supply (MIPS).\nHave extensive knowledge and experience in both public and private sector procurement and supply chain management.\nHave excellent both oral and written communication skills\nHave excellent leadership and interpersonal skills and able to deal with a diverse workforce.\nBe self-motivated, a team player and results oriented.\nBe of high moral and ethical character and integrity and\nHave excellent computer skills.\n\nREMUNERATION PACKAGE\nThe successful candidates shall be offered a performance related contract for a period of three (3) years, with an industry attractive and competitive salary and benefits\nMODE OF APPLICATION\nInterested persons should submit applications by email only to mipsrecruitment@mips.mw, enclosing copies of relevant academic and professional certificates, detailed Curriculum Vitae (CV) with names and contact details of three (3) traceable referees by 4:30 pm on Friday 30th May 2025.\nOnly shortlisted applicants will be acknowledged and invited for interviews"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/05/University-of-Lilongwe-150x150.jpeg",
    "companyName": "University of Lilongwe",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/accounts-assistant-revenue/",
    "location": "Lilongwe",
    "position": "Accounts Assistant Revenue University of Lilongwe",
    "source": "jobsearchmalawi",
    "jobDescription": "Overview\n\n\n\n\n\n\n\nVACANCY: ACCOUNTS ASSISTANT (REVENUE)\nThe University of Lilongwe is seeking applications from highly organized and dedicated individuals to fill the position of Accounts Assistant (Revenue). This role is pivotal in supporting the revenue collection process, ensuring accurate and timely recording, and assisting in the reconciliation of revenue-related accounts.\nReporting Line: Finance Officer\nDuty Station: University of Lilongwe Main Campus\nPosition Type: Full-Time\nPurpose of the Role:\nTo support the efficient management of fee collections and ensure accurate accounting of all revenue transactions. The role will also involve assisting in the preparation of revenue reports and ensuring compliance with financial policies and procedures.\n \nKey Responsibilities:\nThe Accounts Assistant (Revenue) will be responsible for:\n\nIssuing invoices to students, ensuring all invoices are accurately recorded and properly processed.\nIssuing receipts for fee payments and ensuring all records are accurately maintained.\nMonitoring and tracking outstanding fees and following up with students regarding overdue invoices.\nReconciling fees collections in a timely manner.\nAssisting in preparing and updating revenue-related reports, including monthly and annual income statements.\nHandling revenue-related inquiries from Management and other stakeholders in a professional and timely manner.\nEnsuring proper documentation of all fee-related transactions and supporting documents for auditing purposes.\nSupporting the preparation of financial reports related to revenue collections, budgets, and projections.\nAssisting in ensuring compliance with University policies and procedures regarding fee collections.\nAny other duties may be assigned time to time.\n\n \nQualifications and Experience:\n\nDiploma in Accounting, Finance, or a related field from a recognized institution.\nAt least two (2) years of experience in an accounts or revenue-related role, preferably in a higher education setting.\nFamiliarity with accounting software and Microsoft Office, ie: QuickBooks and ERP.\nA Malawi School Certificate of Education (MSCE)\n\nKey Attributes:\n\nStrong attention to detail and accuracy, especially in handling financial transactions.\nExcellent organizational skills with the ability to manage multiple tasks simultaneously.\nStrong communication skills to handle student inquiries and follow-up on fee payments.\nAbility to work independently and meet deadlines.\nHigh level of integrity and professionalism in managing financial information.\n\n \nApplication Process:\nInterested and qualified candidates should submit:\n\nA cover letter outlining their suitability for the role.\nAn updated curriculum vitae.\nCertified copies of academic qualifications and any relevant professional certifications.\n\nNames and contact details of at least two traceable referees.\nCandidates should send their applications to asao@unilil.ac.mw. The subject line of the application should read, “Application for the Post of Accounts Assistant (Revenue)”. Applications should be addressed to:\nThe Registrar,\nUniversity of Lilongwe,\nP.O. Box 1614,\nLilongwe.\nThe deadline for receiving the applications is 23rd May, 2025.\nOnly shortlisted candidates will be acknowledged. Female candidates are encouraged to apply."
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2021/05/MACRA-150x150.jpeg",
    "companyName": "Malawi Communications Regulatory Authority MACRA",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/internal-audit-officer-11/",
    "location": "Lilongwe",
    "position": "Internal Audit Officer Malawi Communications Regulatory Authority MACRA",
    "source": "jobsearchmalawi",
    "jobDescription": "The Malawi Communications Regulatory Authority (MACRA) is a statutory body established under the Communications Act (Cap. 68:01 of the Laws of Malawi) to regulate the country’s communications sector. Under the Communications Act of 2016, MACRA is mandated to regulate and monitor the provision of communications services and ensure that, as far as it is practicable, reliable and affordable communications services are provided throughout Malawi.\nThe Vision of MACRA Communication Services for a digitally transformed Nation. In order to fulfil its mandate effectively and efficiently with strategic leadership and management, an opportunity has arisen within MACRA to fill vacant positions. The positions are highly demanding and requires persons who have demonstrable capacity to initiate innovations geared at making MACRA a rejuvenated, vibrant and competitive Authority. The following are the details of the position.\nJOB TITILE: Internal Audit Officer\nGRADE: MA 6\nDIRECTORATE : Executive\nLOCATION : Lilongwe\nSUPERVISOR : Internal Audit Manager\nMAIN DUTIES OF THE JOB\n\nAssisting in audit planning and engagement of clients.\nCollecting relevant data and documentation related to specific audit assignments.\nCalculating, computing, and verifying data to assist in forming department audit opinion.\nCompiling audit reports.\nReceiving and inspecting reports and invoices.\nParticipating in organizing and maintaining audit working papers.\n\nREQUISITE QUALIFICATION AND EXPERIENCE\nThe desired candidate must possess the following qualifications and experience:\n\nBachelors’ Degree in Auditing, Finance or Accounting\nMust be a registered member of Institute of Internal Auditor (IIA).\nTwo (2) Years experience in Auditing\n\nMETHOD OF APPLICATION\nApplicants are required to apply by filling out the form on the following link https://tinyurl.com/5n9a8bpy. The application process requires you to fill out the form and upload copies of your certificates on the link provided on the form. Please ensure you have a good internet connection. The application process is estimated to take 29 minutes to complete. Please submit your application by end of the day of 30th May 2025. Only short-listed candidates will be acknowledged"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2021/05/MACRA-150x150.jpeg",
    "companyName": "Malawi Communications Regulatory Authority MACRA",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/internal-audit-manager-31/",
    "location": "Lilongwe",
    "position": "Internal Audit Manager Malawi Communications Regulatory Authority MACRA",
    "source": "jobsearchmalawi",
    "jobDescription": "No description found"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2021/05/MACRA-150x150.jpeg",
    "companyName": "Malawi Communications Regulatory Authority MACRA",
    "datePosted": "2025-05-20",
    "jobType": "Temporary",
    "link": "https://jobsearchmalawi.com/job/temporary-broadcasting-monitoring-officer/",
    "location": "Various",
    "position": "Temporary Broadcasting Monitoring Officer Malawi Communications Regulatory Authority MACRA",
    "source": "jobsearchmalawi",
    "jobDescription": "The Malawi Communications Regulatory Authority (MACRA) is a statutory body established under the Communications Act (Cap. 68:01 of the Laws of Malawi) to regulate the country’s communications sector. Under the Communications Act of 2016, MACRA is mandated to regulate and monitor the provision of communications services and ensure that, as far as it is practicable, reliable and affordable communications services are provided throughout Malawi.\nThe Vision of MACRA Communication Services for a digitally transformed Nation. In order to fulfil its mandate effectively and efficiently with strategic leadership and management, an opportunity has arisen within MACRA to fill vacant positions. The positions are highly demanding and requires persons who have demonstrable capacity to initiate innovations geared at making MACRA a rejuvenated, vibrant and competitive Authority. The following are the details of the position.\nJOB TITILE: Temporary Broadcasting Monitoring Officer.\nGRADE: MA 7\nDIRECTORATE: Broadcasting\nLOCATION: Various Duty Stations across Malawi\nSUPERVISOR: Broadcasting Monitoring Supervisor\nJOB PURPOSE\nTo monitor broadcasting licensed broadcasting stations in Malawi. The Monitors are responsible for monitoring compliance of broadcasting stations to the conditions of their license, provisions of the Communications Act and Broadcasting regulations and compiling daily reports on broadcasts and relaying the same to supervisors.\nMAIN DUTIES OF THE JOB\n\nPro- actively listening to broadcasters to monitor broadcasters’ compliance to terms and conditions of broadcasting licenses\nAssisting with investigations where there are public complaints by listening and retrieving reported perceived breaches by broadcasters.\nConduct periodic technical audits on broadcasters to ensure compliance with technical and professional standards as stipulated in the broadcasting licence, Communications Act and Broadcasting Regulations.\nAssisting the Broadcasting Monitoring Supervisor to enforce the code and conduct of broadcasters as stipulated in the broadcasting licences, Communications Act and Broadcasting Regulations.\nAssisting the Broadcasting Monitoring Supervisor in analyzing broadcasts complaints regarding abuse or any perpetrated offences by the electronic media.\nCompiling broadcasting monitoring reports.\nAny other duties as assigned by their superiors from time to time.\n\nREQUISITE QUALIFICATIONS\nThe holder of the position is expected to have the following minimum key qualifications:\n\nDiploma in Journalism or Mass Communications or degree in any media related field. Those with a degree will have an added advantage\nMust be computer literate\nMust have report writing skills\nAbility to work odd hours and without supervision\nMust be knowledgeable in current affairs, broadcasting ethics and Malawi political systems\nKnowledge of local languages in specific areas is an added advantage.\n\nMETHOD OF APPLICATION\nApplicants are required to apply by filling out the form on the following link https://tinyurl.com/5n9a8bpy. The application process requires you to fill out the form and upload copies of your certificates on the link provided on the form. Please ensure you have a good internet connection. The application process is estimated to take 29 minutes to complete. Please submit your application by end of the day of 30th May 2025. Only short-listed candidates will be acknowledged"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2020/07/Malawi-Govt-1-150x150-1-150x150.png",
    "companyName": "Mwanza District Council",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/assistant-environmental-health-officer-7/",
    "location": "Mwanza",
    "position": "Assistant Environmental Health Officer Mwanza District Council",
    "source": "jobsearchmalawi",
    "jobDescription": "No description found"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2020/07/Malawi-Govt-1-150x150-1-150x150.png",
    "companyName": "Mwanza District Council",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/assistant-irrigation-engineer-2/",
    "location": "Mwanza",
    "position": "Assistant Irrigation Engineer Mwanza District Council",
    "source": "jobsearchmalawi",
    "jobDescription": "Local Government Service Commission is inviting applications from suitably qualified Malawian candidates to fill the following vacant posts existing at Mwanza District Council\nASSISTANT IRRIGATION ENGINEER (GRADE K/M8)\nPost: Assistant Irrigation Engineer (Grade K)\nGrade: K/M8\nReporting to: Senior Irrigation Engineer Officer (Grade H)\nLocation: Mwanza District Council\nDUTIES:\n\nLiaise irrigation activities with other stakeholders to promote food security\nConduct engineering surveys and collect data\nConduct agriculture surveys and collect data\nPrepare annual work plans\nCoordinate extension. agronomy and engineering technical services, affairs and responsibilities of the scheme management committees\n\nQUALIFICATION:\nApplicants must be in possession of a Diploma in Irrigation Engineering /Technology.\nApplications with detailed Curriculum Vitae, copies of certificates, and National Identity should be sent to:\nThe Executive Secretary,\nLocal Government Service Commission\nP.O. Box 766\nLILONGWE\nTo reach him not later than 28th May, 2025"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2020/07/Malawi-Govt-1-150x150-1-150x150.png",
    "companyName": "Mwanza District Council",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/health-services-administrator-3/",
    "location": "Mwanza",
    "position": "Health Services Administrator Mwanza District Council",
    "source": "jobsearchmalawi",
    "jobDescription": "Local Government Service Commission is inviting applications from suitably qualified Malawian candidates to fill the following vacant posts existing at Mwanza District Council\nPost: Health Services Administrator\nGrade: I/M6\nLocation: Mwanza District Council\nDuties:\n\nTo be responsible for an effective and efficient provision of administrative services in line with the regulations of the hospital and the Ministry of Health\nTo advise management on an efficient and effective health information system for the hospital\nTo undertake routine office organizational responsibilities\nTo facilitate recruitment, selection and induction of new staff, career development and conditions of service\nControl of establishments- personnel records, staff returns and notifications, sick leave and unpaid leave, terminal benefits\nMonitoring the performance of the staff and service and advise management on training needs.\nTo follow the agreed general administrative services structure and where appropriate, to recommend to management changes in the structures affected\nTo monitor the quality of administrative support provided, review and promote such services on a regular basis\nTo service management committees and attend other meetings as required, ie. provide secretarial service to Hospital Advisory Committee etc\nTo interpret government regulations and procedures through MPSR and other relevant government instructions as amended from time to time\nTo re-enforce the hospitals’ health and safety regulations and ensure implementation thereof\nTo ensure that there is prudent use of hospital’s transport services through regular monitoring of operating/ running costs of vehicles\nTo be responsible for the preparation of budget and authorization of expenditure\nTo be responsible for purchases of hospital’s equipment, stores, foodstuff, etc and ensure safe custody of the same.\n\nQualification:\nApplicants must be holders of Bachelor’s Degree in Public Administration or Human Resource Management, Health Management Political Science or Business Administration obtained from accredited institutions.\nApplications with detailed Curriculum Vitae, copies of certificates, and National Identity should be sent to:\nThe Executive Secretary,\nLocal Government Service Commission\nP.O. Box 766\nLILONGWE\nTo reach him not later than 28th May, 2025"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2020/07/Malawi-Govt-1-150x150-1-150x150.png",
    "companyName": "Mwanza District Council",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/nursing-midwife-technician-mental-health-psychiatric/",
    "location": "Mwanza",
    "position": "Nursing Midwife Technician Mental Health Psychiatric Mwanza District Council",
    "source": "jobsearchmalawi",
    "jobDescription": "Local Government Service Commission is inviting applications from suitably qualified Malawian candidates to fill the following vacant posts existing at Mwanza District Council\nPost: Nursing Midwife Technician (Mental Health/ Psychiatric)\nGrade: K/M8\nLocation: Mwanza District Council\nDuties:\n\nPlans and implements quality mental health/psychiatric nursing care using the nursing process.\nPerforms activities of daily living for the patients 24 hours/day.\nCollaborates with other health workers in meeting specific needs of the patients.\nAdhere to standard precautions of infection prevention and control practices.\nBuilds therapeutic relationship with patients, guardians and fellow health workers.\nDocuments and maintains accurate records of all mental health/ psychiatric nursing care activities performed.\nMaintains professional code of conduct at all times.\nDevelops ward/department policies in consultation with other multidisciplinary team members.\nMonitors that all health workers comply with quality standards of care.\nSupervises Nurse/Midwives, students and Subordinate Staff.\nConducts performance appraisal for subordinates and makes recommendations accordingly.\nCompiles weekly and monthly duty rosters for the ward.\nPlans and conducts regular meetings with different cadres of staff in the ward/department.\nProvides measures for ensuring drug safety and record keeping.\nConducts inventory quarterly and maintains accurate records.\nProvides Supportive Supervision all mental health/psychiatric nursing activities in the health facilities\nParticipates in identification of departmental training needs and conducts on the job training.\nAdheres to continuous professional development.\n\nQualifications:\nApplicants must be in possession of Diploma in Mental Health/Psychiatric and Nursing and Midwifery and must be a registered Nurse with Nurses and Midwives Council of Malawi.\nApplications with detailed Curriculum Vitae, copies of certificates, and National Identity should be sent to:\nThe Executive Secretary,\nLocal Government Service Commission\nP.O. Box 766\nLILONGWE\nTo reach him not later than 28th May, 2025"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2020/07/Malawi-Govt-1-150x150-1-150x150.png",
    "companyName": "Mwanza District Council",
    "datePosted": "2025-05-20",
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/clinical-officer-paediatric-internal-medicine-obstetrics-gynecology-x3/",
    "location": "Mwanza",
    "position": "Clinical Officer Paediatric Internal Medicine Obstetrics Gynecology x3 Mwanza District Council",
    "source": "jobsearchmalawi",
    "jobDescription": "Local Government Service Commission is inviting applications from suitably qualified Malawian candidates to fill the following vacant posts existing at Mwanza District Council\nPost: Clinical Officer (Paediatric, Internal Medicine, Obstetrics & gynecology) (3 positions)\nGrade: I/M6\nLocation: Mwanza District Council\nDuties:\n\nPerform both minor and major operations on their own\nTo ensure effective case management at health institutions\nTo conduct ward rounds,\nTo provide clinical institutions to interns, qualified clinicians,\nComfortably run the emergency medical services and casualty,\nTo conduct clinical research with the idea of getting close to evidence based practice,\nResponsible to DHS, heads of departments if a central hospital deputize the DHS,\nTo conduct routine district visits,\nTo shoulder in-service training and research programs,\nCan run a specific ministry of health program, TB, Malaria control and HIV/AIDS.\n\nQualifications\nApplicants must be) in possession of bachelor’s degree in clinical medicine. BSc in Pediatric and Child Health, Obstetrics & gynecology\nApplications with detailed Curriculum Vitae, copies of certificates, and National Identity should be sent to:\nThe Executive Secretary,\nLocal Government Service Commission\nP.O. Box 766\nLILONGWE\nTo reach him not later than 28th May, 2025"
  }
]