[
  {
    "applicationDeadline": "June 27, 2025",
    "companyLogo": "https://ntchito.com/wp-content/uploads/2025/06/VSO-150x150.avif",
    "companyName": "N/A",
    "datePosted": "N/A",
    "isValidUrl": true,
    "jobType": "Opportunity",
    "link": "https://ntchito.com/job/english-language-teachers-fully-funded-international-volunteering-opportunity/",
    "location": "Uzbekistan",
    "position": "English Language Teachers Fully funded International Volunteering opportunity",
    "scrapedAt": "2025-06-15T12:46:41.133Z",
    "source": "ntchito",
    "jobDescription": "English Language Teachers (Fully funded International Volunteering opportunity)\n \n\n\n\nLocation:\nUzbekistan\n\n\nSalary:\nNot Specified\n\n\nContract Type:\nNot Specified\n\n\nContract Length:\nNot Specified\n\n\nFull Time:\nNot Specified\n\n\nApplication Closing Date:\nJun 27, 2025 00:00:00\n\n\nInterview Date:\nAs soon as possible\n\n\nStart Date:\nSeptember/ October 2025\n\n\nDownload Job Description\nFile Size: 179.39 KBs, File Type: pdf\n\n\n\n\n\n\n\n\n\nRole Overview Summary\n\nVSO, in partnership with the Uzbekistan government, is looking for experienced teaching professionals to help strengthen the teaching of the English language at the secondary school level and build the capacity of in-service teachers.\n \n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tLoading...\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tTaking too long?\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t Reload document\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t Open in new tab\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\tDownload\n \nThis is a unique opportunity to share your expertise and skills, collaborate with local educators, and contribute to sustainable improvements in English language teaching in schools across Uzbekistan. As a volunteer English language teacher, you will work alongside Uzbekistan teachers, delivering school curriculum lessons, professional development, and coaching workshops. You’ll support teachers and students in enhancing their English language proficiency, adopting student-centered methodologies and implementing international best practices. Your experience will help shape the future of English language teaching in Uzbekistan.\n\n\nIdeal Applicant Summary\n\nAre you an experienced English language teacher? Do you have a passion for capacity building and professional development in English language proficiency? Do you want to make a lasting impact on education while immersing yourself in a new culture? If you answered yes to all these questions, we want to hear from you.\nWe’re looking for graduate-qualified English language teaching professionals with a background in TESOL, TEFL, Linguistics, or a related field, who have secondary or high school teaching experience and hold CELTA, DELTA, TEFL, or TESOL certifications. Prior international teaching experience and familiarity with Cambridge, Oxford, or Pearson curricula are desirable.\nEqual Opportunities: VSO promotes equal opportunities and values a diverse workforce.\nVSO reserves the right to close this job early if we receive a sufficient number of applications.\n\n\nAdditional Information\n\nOur Values\nWe seek applicants who reflect and embrace our values of collaboration, integrity and inclusion.\nWe expect candidates to represent themselves honestly at every stage of our recruitment process. This includes the information provided on resumes/CVs, applications, interviews, during the offer and pre-onboarding processes.\nWe want to hear from you if you share our dedication to empowering communities and driving lasting change.\nWhy Volunteer with VSO?\nWe know that volunteering is a big commitment, so we ensure that you are safe, supported, and well-prepared throughout your journey.\n \n🔹 Accommodation & Allowances\n\n Basic local accommodation within the local community.\nA local living allowance that covers reasonable expenses.\nAt least three weeks of annual leave in line with the schools’ holidays period.\nReturn flights to and from the project destination, ensuring a smooth and supported relocation for your volunteer placement.\n\n🔹 Induction\n\nCultural and language training to help you settle in.\nMedical and security briefings to keep you safe.\nOpportunities to meet local volunteers and build a community.\nA clear understanding of your placement objectives and impact.\n\n\n\n\n\n\nTagged as: Education - Teaching jobs"
  }
]