[
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/Corporate-Graphics-Malawi.jpeg",
    "companyName": "Corporate Graphics Malawi",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/copywriter/",
    "location": "Blantyre",
    "position": "Copywriter Corporate Graphics Malawi",
    "scrapedAt": "2025-06-11T08:07:19.543Z",
    "source": "jobsearchmalawi",
    "jobDescription": "Can your words move people, spark conversations, and shift culture?If you love telling stories that stick, crafting lines that land, and turning strategy into scroll-stopping content, then this might be your next chapter.Corporate Graphics is looking for a copywriter who doesn’t just write well but writes right. Someone who understands tone, nuance, rhythm—and can switch seamlessly from urban edge to village tone. Whether it’s Gen Z in Zomba or a rural farming community in Mzimba, your words need to connect, resonate, and feel real.What You’ll Be Doing (Aka, Your Playground)Turning briefs into brilliant concepts and copy for digital, print, radio, TV, and more.Writing content that connects—from website banners to TikTok captions, from policy brochures to community posters.Translating and localising content between English and Chichewa (Tumbuka or any other local language is a big plus).Proofreading like a hawk with grammar, tone, and clarity that’s always on point.Helping maintain studio creative quality control by reviewing and refining others’ copy.Working with creatives, strategists, and account managers to bring ideas to life.Keeping your finger on the pulse of both the city and the village—because our audiences are everywhere.Bridging generations with storytelling that speaks to young people, elders, and everyone in between.What You Bring to the TableA deep love for language—and a gift for turning ideas into impact and action.Excellent written and spoken command of English and Chichewa (extra language? even better!)An intuitive grasp of how tone shifts between urban and rural settings—and how to write content that feels true in both.Experience in copywriting, content creation, or translation (creative/media/marketing industry a plus).Sharp editing and proofreading skills—you see what others miss.The ability to manage multiple projects and deadlines with calm confidence.Team spirit, great communication, and a hunger to learn.Cultural fluency—from trending hashtags to traditional proverbs.Why Join CG?For over 18 years, Corporate Graphics has helped shape some of Malawi’s most trusted and loved brands. We believe in creativity with purpose, storytelling with soul, and messaging that meets people where they are—from the city to the village and the boardroom to the market.If you’re looking for a space where your words can truly make a difference—and where your growth is supported—we’d love to hear from you.Employment Type: Full-time.Location: BlantyreTo apply, fill out the form on the link below by Monday, 16th June 2025.https://forms.gle/hueTKaBw82xjQEPE6"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/UNDP-150x150.png",
    "companyName": "UNDP",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/financing-specialist/",
    "location": "Lilongwe",
    "position": "Financing Specialist UNDP",
    "scrapedAt": "2025-06-11T08:07:19.543Z",
    "source": "jobsearchmalawi",
    "jobDescription": "Job DescriptionBackgroundSince 1964, UNDP has been active in Malawi, aiding the Government in its development agenda by supporting policies, establishing partnerships, and enhancing institutional capacities to achieve national development goals and the Sustainable Development Goals (SDGs). The UNDP Malawi’s Country Programme Document (CPD) for 2024-2028 aligns with the Malawi Vision 2063 and its first 10-Year Implementation Plan, aiming to support Malawi in meeting the SDGs by 2030. This comprehensive programme addresses the interconnected challenges of poverty, inequality, and vulnerability to shocks, organized within two principal portfolios:1. Governance: This portfolio focuses on strengthening effective, accountable, and inclusive governance. It promotes civic engagement, human rights, the rule of law, peace, and democracy, alongside improving data generation and analysis.2. Resilience and Sustainable Growth (RSG): This portfolio focuses on economic innovation, inclusive business, job creation, and renewable energy access. It also aims to help Malawi adapt to climate change and build resilience to disasters.Resilience and Sustainable Growth (RSG) PortfolioThe RSG Portfolio adopts a multifaceted approach combining inclusive growth, sustainability, climate adaptation, resilience to shocks, and agricultural development. It integrates natural resource management, poverty-environment linkages, disaster risk management, and agricultural value chain commercialization. The portfolio engages a broad range of stakeholders, including government entities, development partners, and multilateral agencies. UNDP’s resilience programming within the RSG Portfolio specifically targets the mitigation of threats, risks, and impacts of climate change and related economic and social shocks. The RSG Portfolio also includes a dynamic private sector development programme that employs various de-risking financial instruments to support private sector investments in the country. This programme is designed to assist entrepreneurs at every stage of their journey, from business incubation to acceleration and growth across different economic sectors.The resilience programming takes a holistic approach, addressing interconnected issues such as governance, public services, inclusive economic opportunities, natural resource management, and agricultural development. The primary outcomes target enhancing socio-economic resilience, equitable access to economic opportunities, sustainable natural resource management, and increased agricultural productivity and income for smallholder farmers. This is achieved through collaboration with diverse stakeholders, including government, UN partners, civil society, the private sector, and academia.Agriculture and CommercializationAgriculture is the backbone of Malawi’s economy, employing over 70% of the population and significantly contributing to the country’s Gross Domestic Product (GDP) at 24.7%. While subsistence farming has predominated, there is a growing emphasis on commercialization to unlock the sector’s full potential. This transition from traditional, subsistence-oriented farming to market-oriented, profit-driven activities aligns with the Government’s Agriculture, Tourism, and Mining (ATM) growth strategy. This shift is crucial for enhancing food security, increasing farmers’ incomes, promoting rural development, and achieving broader economic growth objectives. Achieving meaningful commercialization requires targeted interventions, supportive policies, and a solid anchorage for the private sector. Since 2014, UNDP has actively supported the private sector in advancing sustainable development through diverse initiatives and partnerships in agriculture, collaborating closely with mainstream Government Ministries, Departments, and Agencies (MDAs).Through collaboration with private sector entities and leveraging relevant past experiences, the UCHI Strengthening Agricultural Commercialization Project will provide the technical expertise, resources, and networks necessary to tackle challenges related to agricultural commercialization and generate market and financial opportunities for smallholder farmers (SHFs). The project advocates market-oriented business practices and stimulates market and financial opportunities within priority value chains.One of the UCHI Project Outputs is “Improved Financial Access for FOs and Women-Led Agricultural MSMEs”. This output aims to improve financial access for FOs and SMEs, with a particular focus on empowering women-led agribusinesses such that FOs and SMEs can obtain the funding necessary to enter the commercial market. The programme will provide financial management training, facilitate access to loans, and establish a matching grant facility to support productive investments. FOs and SMEs will be equipped to improve their financial literacy, record-keeping, and investment planning, allowing them to secure funding for commercialization and value addition. The matching grant mechanism will be used to support the targeted FOs and SMEs as a bridge to commercial credit and/or investment, fostering financially sustainable business models by prioritizing productivity enhancement, resilience, and commercialization efforts, with a focus on women-owned enterprises to promote inclusive growth.It is on this note that UNDP is seeking to recruit a Financing Specialist to design, roll-out and oversee the management and implementation of the UCHI Commercialization Matching Grant Facility and to lead on the financial access stream of work under the UCHI Strengthening Agricultural Commercialization Project. Position PurposeThe Financing Specialist, working under the direct supervision of the UCHI Project Manager, will play a pivotal role in facilitating the achievement of project objectives by ensuring the efficient use of financial resources, and providing technical expertise on innovative financing and business development opportunities for FOs and MSMEs. The specialist will lead the financial access stream of the Project by designing, rolling out, and overseeing the implementation of the UHCI Commercialization Matching Grant Facility. This includes ensuring a transparent and competitive grant allocation process that fosters business growth for Farmer Organizations (FOs) and MSMEs while maintaining rigorous financial oversight and accountability. Additionally, the Specialist will drive engagement with financial service providers, establishing strategic partnerships to enhance access to finance through tailored financial solutions, including risk-sharing approaches. Beyond financing, the Specialist will support the development and delivery of financial literacy programs and other capacity-building initiatives, equipping project beneficiaries with essential skills in financial management, investment readiness, and business sustainability. The Financing Specialist will collaborate closely with the project team and other stakeholders to ensure the attainment of project objectives. Duties and ResponsibilitiesFiduciary ManagementDesign the UCHI Commercialization Matching Grant Facility;Develop Standard Operating Procedures (SOP) and matching contribution metrics for the matching grant facility in consultation with the Project Manager and Project Specialist;Facilitate development of milestones for each of the grantees (FOs/SMEs) in consultation with the project team and the grantees and align the same with disbursement amounts;Facilitate development of matching grant facility milestone verification tools;Lead the review of disbursement request against milestone achievements;Oversee a portfolio of grants under the UCHI – Agriculture Commercialization Programme, ensuring adherence to financial agreements and monitoring progress against milestones;Ensure that payments are linked to milestones outlined in the contractually binding grant agreements, of which a due diligence and a monitoring plan have been established prior to disbursement;Track and verify expenditures, ensuring that funds are used efficiently and as intended by grantees;Maintain detailed records of payments, disbursements, and financial reports, ensuring transparency and accountability for all grants;Provide regular financial updates to the Project Manager, Project Specialist and UNDP management on grant disbursements, financial status, and compliance;Monitor the disbursement of funds to grantees and prepare detailed records, with all the documentary evidence of how funds are utilized based on the contractual agreements;Participate in due diligence exercises on the selected FO/SMEs.Monitoring and ReportingDevelop and implement a Monitoring and Evaluation (M&E) system to track grant progress, measuring results and impacts relative to the project’s objectives;Monitor grantee progress, identifying any risks or delays and ensuring that corrective actions are taken to stay on track with project goals;Prepare quarterly and annual progress reports on the performance of funded projects, detailing achievements, challenges, and lessons learned;Work closely with the UNDP Malawi M&E team to integrate grants data into the Project’s overall performance tracking system;Submit milestone verification reports and impact assessments to the Project Steering Committee, ensuring that all deliverables are met according to the timeline;Work closely with the M&E Specialist to maintain the implemented Monitoring and Evaluation (M&E) system that measures the results and impacts of UCHI Commercialization Matching Grant Facility;Monitor the progress of grantee projects against the baseline and the implementation agreement or any agreed revisions thereof, and in the event that the project departs from the original plan or other difficulties arise, work with the grantee to address and resolve the shortcomings, seeking the advice and guidance of the Project Manager and Project Specialist as necessary;Continuously monitor grantee performance and alert the Project Manager at the earliest possible of any existing or possible unsatisfactory grantee performance;Work with the M&E Specialist and ensure preparation of a baseline report at the start of the grant implementation and end-line impact reports for each of the contracted grantees that will complete their contractual obligations and conclude all the milestones;Contribute to the presentations on progress during monthly meetings and other scheduled meetings including Project Technical and Steering Committee meetings organized with the funding partners and other stakeholders.Financial Access and PartnershipsLead engagement with financial service providers to facilitate access to finance for project beneficiaries;Design and implement financial solutions tailored to the needs of FOs and MSMEs, including e.g. blended finance mechanisms and risk-sharing approaches;Build strategic partnerships with banks, microfinance institutions, and other funding entities to enhance financing opportunities and technical assistance for the UCHI Project;Advocate for financial products that align with the commercialization needs of FOs and MSMEs;Research and facilitate development of other relevant financial instruments that would be relevant for the UCHI Project and advise the project team as appropriate;Advise FOs and SMEs with grants on how climate-smart agriculture practices can be integrated in FOs/SMEs agricultural commercialization for maximum impact and achievement of project objectives.Financial Literacy and Capacity BuildingDevelop and oversee the financial literacy training program, ensuring beneficiaries gain essential financial management skills;Support the implementation of other relevant capacity-building initiatives to enhance financial planning, investment readiness, and business sustainability;In collaboration with other actors including financial institutions, provide ongoing technical expertise to project beneficiaries on innovative financing, financial and grant management skills, and business development and management strategies;Where applicable, support the Business Development Specialist in offering business advisory services to grantees, including assistance with business planning, market access, and scaling up their operations;Facilitate knowledge-sharing and learning among grantees;Strengthen financial management and record-keeping systems for grant recipients;Provide technical assistance to Fos and MSMEs to ensure proper budgeting and financial sustainability.The incumbent performs other duties within their functional profile as deemed necessary for the efficient functioning of the Office and the Organization.Institutional ArrangementThe Financing Specialist will be based at the UNDP Malawi’s UCHI – Agriculture Commercialization Project Office in Lilongwe, with frequent in-country travel to support grantees in various districts. The Specialist will report to the UCHI Project Manager, and work in close collaboration with the UCHI Project Specialist and other relevant Project staff. The role will also require regular interaction with external stakeholders, including grantees, financial institutions, other UCHI implementing partners and the donor. CompetenciesCOREAchieve Results: LEVEL 3: Set and align challenging, achievable objectives for multiple projects, have lasting impactThink Innovatively: LEVEL 3: Proactively mitigate potential risks, develop new ideas to solve complex problemsLearn Continuously: LEVEL 3: Create and act on opportunities to expand horizons, diversify experiencesAdapt with Agility: LEVEL 3: Proactively initiate and champion change, manage multiple competing demandsAct with Determination:  LEVEL 3: Think beyond immediate task/barriers and take action to achieve greater resultsEngage and Partner: LEVEL 3: Political savvy, navigate complex landscape, champion inter-agency collaborationEnable Diversity and Inclusion: LEVEL 3: Appreciate benefits of diverse workforce and champion inclusivity Cross functional & Technical competencies Business Direction & Strategy: Strategic Thinking    Ability to develop effective strategies and prioritized plans in line with UNDP’s objectives, based on the systemic analysis of challenges, potential risks and opportunities; linking the vision to reality on the ground, and creating tangible solutions;Ability to leverage learning from a variety of sources to anticipate and respond to future trends; to demonstrate foresight in order to model what future developments and possible ways forward look like for UNDP.Business Direction & Strategy: System Thinking Ability to use objective problem analysis and judgement to understand how interrelated elements coexist within an overall process or system, and to consider how altering one element can impact on other parts of the systemBusiness Development: Knowledge FacilitationAbility to animate individuals and communities of contributors to participate and share, particularly externallyBusiness Management: Project Management  Ability to plan, organize, prioritize, and control resources, procedures, and protocols to achieve specific goals.Business Management : CommunicationAbility to communicate in a clear, concise, and unambiguous manner both through written and verbal communication; to tailor messages and choose communication methods depending on the audienceAbility to manage communications internally and externally, through media, social media, and other appropriate channelsPartnership Management: Relationship ManagementAbility to engage with a wide range of public and private partners, build, sustain and/or strengthen working relations, trust, and mutual understanding Required Skills and ExperienceEducation:Master’s degree in Economics, Development Studies, Accounting or related field.A first-level university degree (bachelor’s degree) in combination with an additional two years of qualifying experience will be given due consideration in lieu of the advanced university degree.Experience:Minimum 7  years (with master’s degree) or  9 years (with bachelor’s degree) of relevant experience in providing financial management advisory services, and/or managing staff and operational systems is required.Required SkillsExperience in the use of computers and office software packages (MS Word, Excel, etc.), and advanced knowledge of web-based management systems such as ERP financials;Experience in Programme/Project management and good communication skills;Desired SkillsExperience in management of grant portfolio, matching grant schemes, impact investing, blended finance mechanisms and/or venture capital vehicles;Experience with enterprise and/or Innovation Challenge Fund management services for private and international organizations;Sector knowledge in agriculture and financial innovation including an up to date understanding of market access frontiers for FOs/SMEs and how they may be shifted through small scale agricultural commercialization;Proven experience working on financing for private sector-driven agriculture development working in Africa context. Experience with Malawi is an added advantage;Strong ability to assess business models, financial sustainability, and risk mitigation strategies;Experience in working with UN Agencies or International Organizations would be an advantage.Required LanguageFluency in  English is required.Equal opportunityAs an equal opportunity employer, UNDP values diversity as an expression of the multiplicity of nations and cultures where we operate and, as such, we encourage qualified applicants from all backgrounds to apply for roles in the organization. Our employment decisions are based on merit and suitability for the role, without discrimination.UNDP is also committed to creating an inclusive workplace where all personnel are empowered to contribute to our mission, are valued, can thrive, and benefit from career opportunities that are open to all.Sexual harassment, exploitation, and abuse of authorityUNDP does not tolerate harassment, sexual harassment, exploitation, discrimination and abuse of authority. All selected candidates, therefore, undergo relevant checks and are expected to adhere to the respective standards and principles.Right to select multiple candidatesUNDP reserves the right to select one or more candidates from this vacancy announcement.  We may also retain applications and consider candidates applying to this post for other similar positions with UNDP at the same grade level and with similar job description, experience and educational requirements.Scam alertUNDP does not charge a fee at any stage of its recruitment process. For further information, please see www.undp.org/scam-alert."
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/Corporate-Graphics-Malawi.jpeg",
    "companyName": "Corporate Graphics Malawi",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Internship",
    "link": "https://jobsearchmalawi.com/job/digital-marketing-intern/",
    "location": "Blantyre",
    "position": "Digital Marketing Intern Corporate Graphics Malawi",
    "scrapedAt": "2025-06-11T08:07:19.543Z",
    "source": "jobsearchmalawi",
    "jobDescription": "Join Our Creative Team as a Digital Marketing Intern!Are you curious about how great ideas come to life online? Do you want to learn how top agencies deliver high-impact digital campaigns, not just create them? Corporate Graphics is on the hunt for a Digital Marketing Intern to support our Creative Department in bringing bold ideas to life online. This is a hands-on, behind-the-scenes role perfect for someone organised, digitally curious, and ready to learn the inner workings of great execution. No content creation required to start — just a sharp eye and a steady hand.What you will be doingScheduling approved content on platforms like Instagram, Facebook, LinkedIn and TikTokKeeping post calendars updated and deadlines metMonitor and respond to comments, messages, and tags across platformsMaking sure our creative work shows up correctly — on time, every timeSupporting the creative team with admin and basic digital opsLearning how campaigns are managed from studio to screenWhat we are looking forReliable and detail-orientedDigitally aware and curious about the creative and digital worldComfortable using Google Docs/Sheets and social media toolsA team player with a good attitudeInternship Duration: 3–6 monthsEmployment Type: Part-timeLocation: BlantyreTo Apply: Fill out the form on the link below by Monday, 16th June 2025.https://forms.gle/GP9gPGfpUQro2Nu47"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/UNDP-150x150.png",
    "companyName": "UNDP",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/gender-officer/",
    "location": "Lilongwe",
    "position": "Gender Officer UNDP",
    "scrapedAt": "2025-06-11T08:07:19.543Z",
    "source": "jobsearchmalawi",
    "jobDescription": "Job DescriptionBackgroundSince 1964, UNDP has been active in Malawi, aiding the Government in its development agenda by supporting policies, establishing partnerships, and enhancing institutional capacities to achieve national development goals and the Sustainable Development Goals (SDGs). The UNDP Malawi’s Country Programme Document (CPD) for 2024-2028 aligns with the Malawi Vision 2063 and its first 10-Year Implementation Plan, aiming to support Malawi in meeting the SDGs by 2030. This comprehensive programme addresses the interconnected challenges of poverty, inequality, and vulnerability to shocks, organized within two principal portfolios:Governance: This portfolio focuses on strengthening effective, accountable, and inclusive governance. It promotes civic engagement, human rights, the rule of law, peace, and democracy, alongside improving data generation and analysis.Resilience and Sustainable Growth (RSG): This portfolio focuses on economic innovation, inclusive business, job creation, and renewable energy access. It also aims to help Malawi adapt to climate change and build resilience to disasters. Resilience and Sustainable Growth (RSG) PortfolioThe RSG Portfolio adopts a multifaceted approach combining inclusive growth, sustainability, climate adaptation, resilience to shocks, and agricultural development. It integrates natural resource management, poverty-environment linkages, disaster risk management, and agricultural value chain commercialization. The portfolio engages a broad range of stakeholders, including government entities, development partners, and multilateral agencies. UNDP’s resilience programming within the RSG Portfolio specifically targets the mitigation of threats, risks, and impacts of climate change and related economic and social shocks. The RSG Portfolio also includes a dynamic private sector development programme that employs various de-risking financial instruments to support private sector investments in the country. This programme is designed to assist entrepreneurs at every stage of their journey, from business incubation to acceleration and growth across different economic sectors.The resilience programming takes a holistic approach, addressing interconnected issues such as governance, public services, inclusive economic opportunities, natural resource management, and agricultural development. The primary outcomes target enhancing socio-economic resilience, equitable access to economic opportunities, sustainable natural resource management, and increased agricultural productivity and income for smallholder farmers. This is achieved through collaboration with diverse stakeholders, including government, UN partners, civil society, the private sector, and academia.Agriculture and Commercialization Agriculture is the backbone of Malawi’s economy, employing over 70% of the population and significantly contributing to the country’s Gross Domestic Product (GDP) at 24.7%. While subsistence farming has predominated, there is a growing emphasis on commercialization to unlock the sector’s full potential. This transition from traditional, subsistence-oriented farming to market-oriented, profit-driven activities aligns with the Government’s Agriculture, Tourism, and Mining (ATM) growth strategy. This shift is crucial for enhancing food security, increasing farmers’ incomes, promoting rural development, and achieving broader economic growth objectives. Achieving meaningful commercialization requires targeted interventions, supportive policies, and a solid anchorage for the private sector. Since 2014, UNDP has actively supported the private sector in advancing sustainable development through diverse initiatives and partnerships in agriculture, collaborating closely with mainstream Government Ministries, Departments, and Agencies (MDAs).Through collaboration with private sector entities and leveraging relevant past experiences, the UCHI Strengthening Agricultural Commercialization Project will provide the technical expertise, resources, and networks necessary to tackle challenges related to agricultural commercialization and generate market and financial opportunities for smallholder farmers (SHFs). The project advocates market-oriented business practices and stimulates market and financial opportunities within priority value chains.Despite agriculture’s economic significance, gender disparities persist, limiting women’s participation in commercial farming and agribusiness. It is on this note that UNDP is seeking to acquire the services of a Gender Specialist who will ensure the UCHI Agriculture Commercialization Project adopts a gender-responsive approach, empowering women and marginalized groups.The Gender Officer will provide technical expertise to integrate gender across all UCHI Agriculture Commercialization project outputs. The incumbent will work closely with project staff, government institutions, project donors and the FOs/SMEs to promote gender equality, women’s empowerment, and inclusive economic participation in the project’s agricultural commercialization efforts. Duties and ResponsibilitiesEffective Gender Mainstreaming into the Project Develop gender mainstreaming tools, including training guidelines and Key Performance Indicators (KPIs) for gender-responsive performance management within the UCHI Agriculture Commercialization Project;Conduct gender analysis to identify gender disparities and opportunities in the target value chains and communities;Based on the analysis, design and implement a responsive gender action plan tailored for the UCHI Agriculture Commercialization project aligned to project objectives;Provide substantive oversight of the project’s activities ensuring gender mainstreaming at all levels of the project including financial, procurement and administrative processes;Identify strategic actions as necessary, to be undertaken to improve the quality of implementation, support achievement of related results, and manage the effective application of the project’s Gender Marker;Advise the project team on opportunities for women economic empowerment including but not limited to income generating activities, financial inclusion, governance training, etc.;Introduce gender capacity building targeting both men and women; and promote men’s active role as champions of change towards equality at HH, FO and community levels;Introduce innovative gender mainstreaming tools including the Gender Action Learning Systems – GALS.Monitoring and ReportingProvide technical advice on integrating gender considerations into project monitoring, evaluation, and learning (MEL) frameworks;Prepare periodic reports on gender integration, progress and impact within the project;Provide advice on appropriate gender sensitive indicators across the project and support the project team in the monitoring and reporting of results/outputs and objectives against agreed indicators, in close collaboration with the UCHI Agriculture Commercialization Project’s Monitoring, Evaluation and Learning Specialist;Provide substantive inputs into all reports (semi-annual, annual and donor reports) to ensure they are gender sensitive and have included all required gender considerations;Introduce a community feedback mechanism to give room to project beneficiaries to report any forms of misconduct, sexual exploitation and abuse; and provide feedback on project implementation.Knowledge Building and Advocacy Ensure that all UCHI Agriculture Commercialization Project staff and beneficiaries are equipped to sustain mainstreaming gender equality objectives/goals in their respective areas of work;Maintain relationships with UCHI partners including other UN agencies, donors, and government agencies on matters related to the promotion of national commitments to gender equality with a view of ensuring strategic partnerships and strengthening collaboration in the implementation of the gender action plan within the UCHI Agriculture Commercialization Project;Consolidate gender lessons learned and recommendations for dialogue, advocacy, and future programming, and organize dissemination of learning with key project partners;Contribute to knowledge networks and communities of practice where good practices in terms of gender mainstreaming are showcased. The incumbent performs other duties within their functional profile as deemed necessary for the efficient functioning of the Office and the Organization. Institutional ArrangementThe Gender Officer will be based at the UNDP Malawi’s UCHI – Agriculture Commercialization Project Office in Lilongwe, with in-country travel to various districts as required. The Gender Officer will report to the UCHI Project Manager, and work in close collaboration with other relevant project staff. CompetenciesCOREAchieve Results: LEVEL 1: Plans and monitors own work, pays attention to details, delivers quality work by deadlineThink Innovatively: LEVEL 1: Open to creative ideas/known risks, is pragmatic problem solver, makes improvementsLearn Continuously: LEVEL 1: Open minded and curious, shares knowledge, learns from mistakes, asks for feedbackAdapt with Agility: LEVEL 1: Adapts to change, constructively handles ambiguity/uncertainty, is flexibleAct with Determination:  LEVEL 1: Shows drive and motivation, able to deliver calmly in face of adversity, confidentEngage and Partner: LEVEL 1: Demonstrates compassion/understanding towards others, forms positive relationshipsEnable Diversity and Inclusion: LEVEL 1: Appreciate/respect differences, aware of unconscious bias, confront discrimination Cross-Functional & Technical competenciesBusiness Management: CommunicationAbility to communicate in a clear, concise, and unambiguous manner both through written and verbal communication; to tailor messages and chose communication methods depending on the audience.Ability to manage communications internally and externally, through media, social media, and other appropriate channels.Business Development: Knowledge facilitationAbility to animate individuals and communities of contributors to participate and share, particularly externally.Business Direction & Strategy  Effective Decision MakingAbility to take decisions in a timely and efficient manner in line with one’s authority, area of expertise and resources.Business Direction & Strategy  Negotiate and influenceAbility to reach an understanding, persuade others, resolve points of difference, gain advantage in the outcome of dialogue, negotiates mutually acceptable solutions through compromise and creates “win-win” situations.2030 Agenda: PeopleGender mainstreaming Required Skills and ExperienceEducation:Advanced university degree (master’s degree or equivalent) in Gender Studies, Development Studies, Social Sciences or relevant related fields is required ORA first-level university degree (bachelor’s degree) in a relevant field in combination with an additional two years of qualifying experience will be given due consideration in lieu of the advanced university degree.Experience:Applicants with Master’s degree (or equivalent) in a relevant field of study are not required to have professional work experience. Applicants with a Bachelor’s degree (or equivalent) are required to have a minimum of two (2) years of relevant professional experience in gender mainstreaming, women’s empowerment, and inclusive development.Required SkillsProven experience in conducting gender analyses, designing gender-responsive interventions, and working with farmer organizations and private sector actors.Desired SkillsExperience in agriculture or rural development programs is preferable;Strong understanding of Malawi’s gender policies, rural development frameworks, and international gender equality commitments;Experience in assessing gender barriers at community level and development of tailored interventions to address inequalities and increase women’s power and agency;Experience in gender-related capacity-building, stakeholder engagement, and policy advocacy;Excellent analytical, communication, and report-writing skills.Required LanguagesFluency in English with proficiency in effective written and oral communications is required.Fluency in Chichewa is required.Knowledge of other local languages is an asset. Equal opportunityAs an equal opportunity employer, UNDP values diversity as an expression of the multiplicity of nations and cultures where we operate and, as such, we encourage qualified applicants from all backgrounds to apply for roles in the organization. Our employment decisions are based on merit and suitability for the role, without discrimination.UNDP is also committed to creating an inclusive workplace where all personnel are empowered to contribute to our mission, are valued, can thrive, and benefit from career opportunities that are open to all.Sexual harassment, exploitation, and abuse of authorityUNDP does not tolerate harassment, sexual harassment, exploitation, discrimination and abuse of authority. All selected candidates, therefore, undergo relevant checks and are expected to adhere to the respective standards and principles.Right to select multiple candidatesUNDP reserves the right to select one or more candidates from this vacancy announcement.  We may also retain applications and consider candidates applying to this post for other similar positions with UNDP at the same grade level and with similar job description, experience and educational requirements.Scam alertUNDP does not charge a fee at any stage of its recruitment process. For further information, please see www.undp.org/scam-alert.Required SkillsCommunication SkillsGender Mainstreaming"
  },
  {
    "applicationDeadline": "17 Jun 2025 11:55 PM",
    "companyLogo": "https://logowik.com/content/uploads/images/930_unicef.jpg",
    "companyName": "UNICEF",
    "datePosted": "11 Jun 2025",
    "jobType": "Consultant",
    "link": "https://jobs.unicef.org/en-us/job/581701/international-consultant-for-vaccine-management-officer-vmo-niamey-niger-6-months",
    "location": "Niger",
    "position": "International Consultant for Vaccine Management Officer VMO Niamey Niger 6 months",
    "scrapedAt": "2025-06-11T08:07:31.495Z",
    "source": "unicef-careers",
    "jobDescription": "UNICEF works in some of the world’s toughest places, to reach the world’s most disadvantaged children. To save their lives. To defend their rights. To help them fulfill their potential. \nAcross 190 countries and territories, we work for every child, everywhere, every day, to build a better world for everyone. \nAnd we never give up. \nFor every child, health! \nTimely and equitable immunization service delivery is amongst the most cost-effective development interventions with sustained and long-term health and economic dividends for nations. And effective end-to-end vaccine stock management is at its core, ensuring life-saving vaccines are always available up to the last mile, coverage goals are met, and no child is left behind. \nHowever, each year, health facilities in Niger experience one or more vaccine insufficiency lasting for one month or more due to weak vaccines stock management. \nSub-optimal stock management not only increases the operational and opportunity costs of vaccination but can also play a significant role in broadening inequities and stagnating demand, specifically affecting under-served urban poor, insecure and hard-to-reach populations. Assessment Efficiency Vaccine Management held in 2020 developed a dashboard to improve vaccine management to ensure that health facilities receive needed quantities of vaccines on time. \nAlso, Niger conducted the Auto Assessment of Efficiency Vaccines Management (EVM) in 2022 and, the implementing of continuous improvement plan will allow to reinforce all logistics components. \nTo proactively address vaccine stock management challenges for both Polio campaigns and Routine Immunization (RI) and, ensure the implementing and monitoring of dashboard and continuous improvement plan of EVM, UNICEF would like to recruit international consultant of Vaccine Management Officer (VMO).\nThe Vaccine Manager Officer will be responsible for providing technical support in the preparation, implement, and evaluation of logistical activities for Polio campaigns, and the implementing of EVM continuous improvement plan.\nHow can you make a difference? \nUnder the overall supervision of Cold Chain and Logistics Specialist, the VMO will be accountable for the following key deliverables. \n• Ensure issues in vaccine management are identified and timely and actively addressed. \n• Follow up on the implementation of continuous improvement plan.\n• Contribute on the implementation EVM-Assessment 2024. \n• Support of Expanded Programme Immunization national warehouse officers to effectively manage the arrivals, storage, temperature monitoring and control during storage and distribution and redistribution, equipment and vaccine accountability, disposal and waste management for polio campaigns and routine vaccines. \n• Support the design of distribution plans, installation budgets, and provide technical support in the supervision of cold chain equipment installations.\n• Mapping of cold rooms and dry warehouses.\n• Strengthen the capacity of logisticians in the polio campaigns.\n• Facilitate Niger logistics team access to up-to-date stock management data including on forecast/actual quantities, stock-on-hand, consumption rates, expiry dates, open and closed vial wastage, critical operational challenges, and data use for action. \n• Ensure the regular availability of vaccines and other inputs in all health facilities offering immunization services.\nKey function, accountabilities and related duties/tasks\n• The main objective of the Vaccine Management and Cold Chain and Logistic Specialist is to support the identified provinces in the capitalization of the acquired knowledge, the transfer of competence in systematic immunization, the preparation and implementation of the logistical activities of polio and other epidemic responses. All these activities will be carried out with the aim of strengthening EPI vaccine management in an integrated manner. \nDetails of the ToR including are available here VA-International Consultant for VMO.pdf\nTo qualify as an advocate for every child you will have… \n\n\nMaster’s degree is required, preferably in relevant field (e.g., business planning, supply chain management, procurement, logistics, or other quantitative degree).\nAt least two (2) years of experience in international public health programme management and five (5) year in immunization, with experience in low- and middle-income countries.\nExperience in the below areas will be considered as an asset:\n• Logistics management systems. \n• Supply chain bottleneck and root cause analysis.\n• Familiarity with inventory policies, allocation, ordering and distribution strategies and other supply chain operations. \n• Health systems strengthening \n• Assessing and measuring supply chain performance. \n• Experience in training, planning and delivery of technical assistance.\n• Effective presenter including ability to adapt the message and visual aids for multiple audiences to deliver concise, impactful presentations.\n• Knowledge of supply chain management and operations \n• Excellent analysis skills \n• Demonstrated ability to work in a multi-cultural environment. \n• Proficiency in MS Excel, PowerPoint, Word \n• Familiarity with SMT, ODK, ViVa and field data collection is an asset. \n• Communication and training skills and, Fluency in French, good knowledge of English is an asset.  \n\n\nDeveloping country work experience and/or familiarity with emergency is considered an asset. \n\n\nFor every Child, you demonstrate… \nUNICEF's values of Care, Respect, Integrity, Trust, Accountability, and Sustainability (CRITAS). \n  \nTo view our competency framework, please visit  here. \nUNICEF is committed to diversity and inclusion within its workforce, and encourages all candidates, irrespective of gender, nationality, religious or ethnic background, and persons with disabilities, to apply to become a part of the organization. To create a more inclusive workplace, UNICEF offers paid parental leave, breastfeeding breaks, and reasonable accommodation for persons with disabilities. UNICEF strongly encourages the use of flexible working arrangements. Click here to learn more about flexible work arrangements, well-being, and benefits.\nAccording to the UN Convention on the Rights of Persons with Disabilities (UNCRPD), persons with disabilities include those who have long-term physical, mental, intellectual, or sensory impairments which, in interaction with various barriers, may hinder their full and effective participation in society on an equal basis with others. In its Disability Inclusion Policy and Strategy 2022-2030, UNICEF has committed to increase the number of employees with disabilities by 2030. At UNICEF, we provide reasonable accommodation for work-related support requirements of candidates and employees with disabilities. Also, UNICEF has launched a Global Accessibility Helpdesk to strengthen physical and digital accessibility. If you are an applicant with a disability who needs digital accessibility support in completing the online application, please submit your request through the accessibility email button on the UNICEF Careers webpage Accessibility | UNICEF.\nUNICEF does not hire candidates who are married to children (persons under 18). UNICEF has a zero-tolerance policy on conduct that is incompatible with the aims and objectives of the United Nations and UNICEF, including sexual exploitation and abuse, sexual harassment, abuse of authority and discrimination based on gender, nationality, age, race, sexual orientation, religious or ethnic background or disabilities. UNICEF is committed to promote the protection and safeguarding of all children. All selected candidates will, therefore, undergo rigorous reference and background checks, and will be expected to adhere to these standards and principles. Background checks will include the verification of academic credential(s) and employment history. Selected candidates may be required to provide additional information to conduct a background check, and selected candidates with disabilities may be requested to submit supporting documentation in relation to their disability confidentially.\nRemarks:  \nOnly shortlisted candidates will be contacted and advance to the next stage of the selection process. \nIndividuals engaged under a consultancy or individual contract will not be considered “staff members” under the Staff Regulations and Rules of the United Nations and UNICEF’s policies and procedures, and will not be entitled to benefits provided therein (such as leave entitlements and medical insurance coverage). Their conditions of service will be governed by their contract and the General Conditions of Contracts for the Services of Consultants and Individual Contractors. Consultants and individual contractors are responsible for determining their tax liabilities and for the payment of any taxes and/or duties, in accordance with local or other applicable laws. \nThe selected candidate is solely responsible to ensure that the visa (applicable) and health insurance required to perform the duties of the contract are valid for the entire period of the contract. Selected candidates are subject to confirmation of fully-vaccinated status against SARS-CoV-2 (Covid-19) with a World Health Organization (WHO)-endorsed vaccine, which must be met prior to taking up the assignment. It does not apply to consultants who will work remotely and are not expected to work on or visit UNICEF premises, programme delivery locations or directly interact with communities UNICEF works with, nor to travel to perform functions for UNICEF for the duration of their consultancy contracts."
  }
]