[
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/HAIL-COTTON-150x150.webp",
    "companyName": "Hail Cotton Malawi Ltd",
    "datePosted": "2025-06-12",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/driver-2/",
    "location": "Lilongwe",
    "position": "Driver Hail Cotton Malawi Ltd",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "No description found"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/opportunity_international_logo.jpeg",
    "companyName": "Opportunity International",
    "datePosted": "2025-06-12",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/project-officer-graduation-program/",
    "location": "Lilongwe",
    "position": "Project Officer Graduation Program Opportunity International",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "The Project Officer, Graduation Program, is responsible for managing the implementation of a customized graduation program in Malawi, with a focus on economically empowering ultra-poor families. This includes assessing the poverty landscape and identifying opportunities within the implementation areas, selecting program participants, and building their capacities for resilience. The officer will champion Opportunity’s vision role, coordinating with various stakeholders, overseeing program activities, and ensuring that participants achieve sustainable livelihoods and successfully graduate from the program. Acting as the bridge between Opportunity Malawi and the communities it serves, the officer must be a trusted and engaging communicator, delivering tailored empowering interventions to marginalized individuals to help them transform their lives, businesses, and families.RESPONSIBILITIES include the following. Other duties may be assigned.Technical TasksOversee and ensure the quality and accuracy of the participant selection process.Conduct household visits to verify the eligibility of selected households.Identify and facilitate access to local economic opportunities for ultra-poor households, integrating them into sustainable income-generating activities.Provide ongoing guidance and technical assistance to participants, helping them adhere to best practices for livelihood improvement.Supervise the efficient and effective use of program assets, cash, and other resources to improve participants’ economic and social conditions.Facilitate and organize exposure, learning or exchange visits, and other events for the program staff and participants to foster learning and experience sharing.Ensure timely procurement of and delivery of the right quality and quantity of program tools required by the participants and ensure these are appropriately used .Monitoring, Evaluation, Documentation, and Reporting.Conduct regular household visits to monitor progress, ensure the quality of graduation assessments, and track progress against program indicators.Ensure that all participants achieve quality graduation.Consolidatemonthly, quarterly, and annual activity reports and special events showing achievements, lessons, constraints, and recommendations to the relevant authority.Participate in field-level assessment and/or evaluation of project performance.CoordinationMonitor the development of Case Workers and Sector Specialists and support their professional growth.Conduct annual performance reviews to ensure continuous improvement.Build relationships and coordinate with stakeholders including local leaders, district authorities, microfinance institutions, etc., and relevant government Ministries/departments.Identify community challenges and opportunities, tailor deliveries, and/or seek new resources to meet needs.Relationship BuildingAct as a liaison between the communities and Opportunity.Identify opportunities for the expansion of Opportunity’s programs.Ethically champion and model the core values of Opportunity in the communities.SafeguardingUphold and promote safeguarding standards within the program.Read, understand, and practice safeguarding policies, ensuring they are implemented in all activities.Follow safeguarding reporting procedures and encourage others to do the same.SUPERVISORY RESPONSIBILITY     Case WorkersSector SpecialistsQUALIFICATIONSA degree in a relevant rural, agricultural, or community development field.Minimum of 3 years’ experience in rural, community, agricultural, or economic development.Experience implementing a graduation program.Strong understanding of the target market and the value of community trust.Excellent organizational, multitasking, and consensus-building abilities.A team player with excellent interpersonal, writing, speaking, and presentation skills.Computer literacy, including spreadsheets, word processing, data entry programs, tablets, and other mobile technology.Passionate about Opportunity’s mission. Able to promote and communicate the organization’s goals and objectives to external and internal stakeholders.Must hold a motorcycle driving license or be willing to acquire one.LANGUAGE SKILLSWritten and verbal fluency in English and Chichewa required, additional 1 or 2 local languages preferred.Must be able to attend & fully participate in meetings conducted in English.CONTRACT TYPE 2 years fixed termTRAVEL REQUIREMENTSTravel to the community almost daily to deliver projects and interact with the communities, investigate expansion opportunities, and respond to community requests.Travel to other districts within Malawi for cross-learning activities, workshops, conferences, and other meetings as and when required."
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/Alliance-of-Bioversity-International-and-CIAT-150x150.png",
    "companyName": "Alliance of Bioversity International and CIAT",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Consultant",
    "link": "https://jobsearchmalawi.com/job/consultancy-for-business-acceleration-for-youth-project-360-appraisal/",
    "location": "Malawi",
    "position": "Consultancy For Business Acceleration For Youth Project 360 Appraisal Alliance of Bioversity International and CIAT",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "Terms of ReferenceCONSULTANCY FOR BUSINESS ACCELERATION FOR YOUTH PROJECT 360 APPRAISALProject Background Business Acceleration for Youth project is a four-year, innovative initiative implemented by the Alliance of Bioversity International and International Center for Tropical Agriculture (CIAT). Framed around a resilience-led sustainability strategy, the project aims to strengthen the resilience of youth and women-led businesses through the delivery of business development services, creating growth-oriented, sustainable firms able to secure and effectively utilize investment. As part of its acceleration program, 60 Micro, Small and Medium Enterprises (MSMEs) have received bespoke technical assistance from six selected Business Development Services (BDS) providers. The contracted BDS providers were tasked to build the capacity of the 60 MSMEs) through one-on-one coaching, targeted consulting interventions, facilitating business linkages and access to services, including finance. We are calling for proposals from experienced consultants to assess the capacity and impact that Business Development Service providers delivering the acceleration services have had with the SMEs. Description of the assignment The goal of the assignment is to conduct a 360-degree appraisal of six BDS providers engaged by the Business Acceleration for Youth project to assess the quality and impact of the technical assistance delivered to MSMEs participating in the acceleration program. The methodologies while broadly the same (needs assessment, intervention, mentoring/coaching), the combination of interventions for each SME was dependent on the results of their needs assessment. It is important to assess which ones worked best (and why) in achieving the Business Acceleration for Youth theory of change.Therefore, the appraisal will need to tap into stakeholder perspectives with regard to the quality of the acceleration services offered, looking into, but not limited to, the methodologies for conducting needs assessment, work plan development, training, coaching and mentoring, monitoring, and growth of the businesses. In addition, the appraisal should evaluate the capacity of Business Development Service (BDS) providers throughout the acceleration process, and their role in strengthening the local capacity of MSMEs for investor matchmaking and capital mobilization. Ultimately, the consultant should provide recommendations drawn from the conclusions of the appraisal, which will help inform future design thinking of the project.Purpose and expected resultsPurposeConduct a 360-degree appraisal for six business development service providers to establish their quality of service and capacity to deliver services that align with the business acceleration for youth project’s objectives and deliverables drawing from the experiences and feedback of key stakeholders involved in the acceleration program.Expected results A comprehensive report documenting and highlighting the various perspectives of the key stakeholders of the project on the following areas:The successes experienced in the delivery of the acceleration servicesThe quality, relevance and customization of the technical assistance provided including how well services were tailored to SME needs and aligned to project objectives.The key lessons learned during the delivery of the acceleration servicesThe challenges encountered in the delivery of the acceleration servicesThe recommendations for future implementation of acceleration servicesThe overall level of satisfaction of the services for participantsDegree of change or improvement in SME performance (business planning, financial management, investor readiness, etc.) as attributed to BDS provider support.Scope of workDetailed tasksThe consultant willConduct desk research of the program and benchmarking against other programs in Malawi and across the regionInterview the MSMEs in three districtsSurvey/interview all six BDS providers on delivery to each of the MSMESurvey Alliance of Bioversity International and CIAT staffLocation of the assignment:The consultant(s) will be expected to conduct an appraisal of the business development service providers delivery in the following districts: Blantyre, Lilongwe, and Mzimba (Mzuzu)Anticipated start date: 13th July 2025Duration of contract: 6 weeks DeliverablesMilestone and Percentage Contract ValueMeans of VerificationMilestone 1. Contract signature (15%)Submission of full signed contract.Submission of workplanMilestone 2. Development of survey and interview tools (30%)Submission of developed tools Milestone 3. Conduct surveys and interviews (30%)Submission of meeting attendance sheets Milestone 4. Completion of appraisal report (25%)Submission of interview transcriptsSubmission of survey response sheetsSubmission of recordings Submission of analysis reportTechnical Proposal and Supporting DocumentsOfferers are requested to submit a technical proposal that outlines the process flow for the 360-degree appraisal. As part of the submission process, offerers are required to submit the following supporting documents as part of their technical proposal:The CV of the proposed ‘Project Manager,’ who will be responsible for supervising the execution of activities under this contract and will be the main point of contact between ABC and the contractor. If conducted by a consultancy firm, the CVs of any other staff that may be involved in the intervention. Proposed assignment workplan including description of how services will be delivered both physically and remotely in the target locations.Data analysis techniques to be utilizedProof of execution of similar assignments previously (please note formal references will be requested before final contracting).If applying as a firm include business registration and Tax clearance certificates.Financial ProposalBased upon the above information, Offerers are requested to provide a detailed cost proposal for the delivery of services in local currency. Please note that ABC is legally obliged to apply withholding tax where appropriate.SubmissionApplications should be submitted electronically by midday Monday 4th July 2025 to the following email address: businessacceleration4youth@outlook.com. Please indicate in the subject ‘Response to BA4Y Request for Acceleration Appraisal.’"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/Corporate-Graphics-Malawi.jpeg",
    "companyName": "Corporate Graphics Malawi",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/copywriter/",
    "location": "Blantyre",
    "position": "Copywriter Corporate Graphics Malawi",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "Can your words move people, spark conversations, and shift culture?If you love telling stories that stick, crafting lines that land, and turning strategy into scroll-stopping content, then this might be your next chapter.Corporate Graphics is looking for a copywriter who doesn’t just write well but writes right. Someone who understands tone, nuance, rhythm—and can switch seamlessly from urban edge to village tone. Whether it’s Gen Z in Zomba or a rural farming community in Mzimba, your words need to connect, resonate, and feel real.What You’ll Be Doing (Aka, Your Playground)Turning briefs into brilliant concepts and copy for digital, print, radio, TV, and more.Writing content that connects—from website banners to TikTok captions, from policy brochures to community posters.Translating and localising content between English and Chichewa (Tumbuka or any other local language is a big plus).Proofreading like a hawk with grammar, tone, and clarity that’s always on point.Helping maintain studio creative quality control by reviewing and refining others’ copy.Working with creatives, strategists, and account managers to bring ideas to life.Keeping your finger on the pulse of both the city and the village—because our audiences are everywhere.Bridging generations with storytelling that speaks to young people, elders, and everyone in between.What You Bring to the TableA deep love for language—and a gift for turning ideas into impact and action.Excellent written and spoken command of English and Chichewa (extra language? even better!)An intuitive grasp of how tone shifts between urban and rural settings—and how to write content that feels true in both.Experience in copywriting, content creation, or translation (creative/media/marketing industry a plus).Sharp editing and proofreading skills—you see what others miss.The ability to manage multiple projects and deadlines with calm confidence.Team spirit, great communication, and a hunger to learn.Cultural fluency—from trending hashtags to traditional proverbs.Why Join CG?For over 18 years, Corporate Graphics has helped shape some of Malawi’s most trusted and loved brands. We believe in creativity with purpose, storytelling with soul, and messaging that meets people where they are—from the city to the village and the boardroom to the market.If you’re looking for a space where your words can truly make a difference—and where your growth is supported—we’d love to hear from you.Employment Type: Full-time.Location: BlantyreTo apply, fill out the form on the link below by Monday, 16th June 2025.https://forms.gle/hueTKaBw82xjQEPE6"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/UNDP-150x150.png",
    "companyName": "UNDP",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/financing-specialist/",
    "location": "Lilongwe",
    "position": "Financing Specialist UNDP",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "Job DescriptionBackgroundSince 1964, UNDP has been active in Malawi, aiding the Government in its development agenda by supporting policies, establishing partnerships, and enhancing institutional capacities to achieve national development goals and the Sustainable Development Goals (SDGs). The UNDP Malawi’s Country Programme Document (CPD) for 2024-2028 aligns with the Malawi Vision 2063 and its first 10-Year Implementation Plan, aiming to support Malawi in meeting the SDGs by 2030. This comprehensive programme addresses the interconnected challenges of poverty, inequality, and vulnerability to shocks, organized within two principal portfolios:1. Governance: This portfolio focuses on strengthening effective, accountable, and inclusive governance. It promotes civic engagement, human rights, the rule of law, peace, and democracy, alongside improving data generation and analysis.2. Resilience and Sustainable Growth (RSG): This portfolio focuses on economic innovation, inclusive business, job creation, and renewable energy access. It also aims to help Malawi adapt to climate change and build resilience to disasters.Resilience and Sustainable Growth (RSG) PortfolioThe RSG Portfolio adopts a multifaceted approach combining inclusive growth, sustainability, climate adaptation, resilience to shocks, and agricultural development. It integrates natural resource management, poverty-environment linkages, disaster risk management, and agricultural value chain commercialization. The portfolio engages a broad range of stakeholders, including government entities, development partners, and multilateral agencies. UNDP’s resilience programming within the RSG Portfolio specifically targets the mitigation of threats, risks, and impacts of climate change and related economic and social shocks. The RSG Portfolio also includes a dynamic private sector development programme that employs various de-risking financial instruments to support private sector investments in the country. This programme is designed to assist entrepreneurs at every stage of their journey, from business incubation to acceleration and growth across different economic sectors.The resilience programming takes a holistic approach, addressing interconnected issues such as governance, public services, inclusive economic opportunities, natural resource management, and agricultural development. The primary outcomes target enhancing socio-economic resilience, equitable access to economic opportunities, sustainable natural resource management, and increased agricultural productivity and income for smallholder farmers. This is achieved through collaboration with diverse stakeholders, including government, UN partners, civil society, the private sector, and academia.Agriculture and CommercializationAgriculture is the backbone of Malawi’s economy, employing over 70% of the population and significantly contributing to the country’s Gross Domestic Product (GDP) at 24.7%. While subsistence farming has predominated, there is a growing emphasis on commercialization to unlock the sector’s full potential. This transition from traditional, subsistence-oriented farming to market-oriented, profit-driven activities aligns with the Government’s Agriculture, Tourism, and Mining (ATM) growth strategy. This shift is crucial for enhancing food security, increasing farmers’ incomes, promoting rural development, and achieving broader economic growth objectives. Achieving meaningful commercialization requires targeted interventions, supportive policies, and a solid anchorage for the private sector. Since 2014, UNDP has actively supported the private sector in advancing sustainable development through diverse initiatives and partnerships in agriculture, collaborating closely with mainstream Government Ministries, Departments, and Agencies (MDAs).Through collaboration with private sector entities and leveraging relevant past experiences, the UCHI Strengthening Agricultural Commercialization Project will provide the technical expertise, resources, and networks necessary to tackle challenges related to agricultural commercialization and generate market and financial opportunities for smallholder farmers (SHFs). The project advocates market-oriented business practices and stimulates market and financial opportunities within priority value chains.One of the UCHI Project Outputs is “Improved Financial Access for FOs and Women-Led Agricultural MSMEs”. This output aims to improve financial access for FOs and SMEs, with a particular focus on empowering women-led agribusinesses such that FOs and SMEs can obtain the funding necessary to enter the commercial market. The programme will provide financial management training, facilitate access to loans, and establish a matching grant facility to support productive investments. FOs and SMEs will be equipped to improve their financial literacy, record-keeping, and investment planning, allowing them to secure funding for commercialization and value addition. The matching grant mechanism will be used to support the targeted FOs and SMEs as a bridge to commercial credit and/or investment, fostering financially sustainable business models by prioritizing productivity enhancement, resilience, and commercialization efforts, with a focus on women-owned enterprises to promote inclusive growth.It is on this note that UNDP is seeking to recruit a Financing Specialist to design, roll-out and oversee the management and implementation of the UCHI Commercialization Matching Grant Facility and to lead on the financial access stream of work under the UCHI Strengthening Agricultural Commercialization Project. Position PurposeThe Financing Specialist, working under the direct supervision of the UCHI Project Manager, will play a pivotal role in facilitating the achievement of project objectives by ensuring the efficient use of financial resources, and providing technical expertise on innovative financing and business development opportunities for FOs and MSMEs. The specialist will lead the financial access stream of the Project by designing, rolling out, and overseeing the implementation of the UHCI Commercialization Matching Grant Facility. This includes ensuring a transparent and competitive grant allocation process that fosters business growth for Farmer Organizations (FOs) and MSMEs while maintaining rigorous financial oversight and accountability. Additionally, the Specialist will drive engagement with financial service providers, establishing strategic partnerships to enhance access to finance through tailored financial solutions, including risk-sharing approaches. Beyond financing, the Specialist will support the development and delivery of financial literacy programs and other capacity-building initiatives, equipping project beneficiaries with essential skills in financial management, investment readiness, and business sustainability. The Financing Specialist will collaborate closely with the project team and other stakeholders to ensure the attainment of project objectives. Duties and ResponsibilitiesFiduciary ManagementDesign the UCHI Commercialization Matching Grant Facility;Develop Standard Operating Procedures (SOP) and matching contribution metrics for the matching grant facility in consultation with the Project Manager and Project Specialist;Facilitate development of milestones for each of the grantees (FOs/SMEs) in consultation with the project team and the grantees and align the same with disbursement amounts;Facilitate development of matching grant facility milestone verification tools;Lead the review of disbursement request against milestone achievements;Oversee a portfolio of grants under the UCHI – Agriculture Commercialization Programme, ensuring adherence to financial agreements and monitoring progress against milestones;Ensure that payments are linked to milestones outlined in the contractually binding grant agreements, of which a due diligence and a monitoring plan have been established prior to disbursement;Track and verify expenditures, ensuring that funds are used efficiently and as intended by grantees;Maintain detailed records of payments, disbursements, and financial reports, ensuring transparency and accountability for all grants;Provide regular financial updates to the Project Manager, Project Specialist and UNDP management on grant disbursements, financial status, and compliance;Monitor the disbursement of funds to grantees and prepare detailed records, with all the documentary evidence of how funds are utilized based on the contractual agreements;Participate in due diligence exercises on the selected FO/SMEs.Monitoring and ReportingDevelop and implement a Monitoring and Evaluation (M&E) system to track grant progress, measuring results and impacts relative to the project’s objectives;Monitor grantee progress, identifying any risks or delays and ensuring that corrective actions are taken to stay on track with project goals;Prepare quarterly and annual progress reports on the performance of funded projects, detailing achievements, challenges, and lessons learned;Work closely with the UNDP Malawi M&E team to integrate grants data into the Project’s overall performance tracking system;Submit milestone verification reports and impact assessments to the Project Steering Committee, ensuring that all deliverables are met according to the timeline;Work closely with the M&E Specialist to maintain the implemented Monitoring and Evaluation (M&E) system that measures the results and impacts of UCHI Commercialization Matching Grant Facility;Monitor the progress of grantee projects against the baseline and the implementation agreement or any agreed revisions thereof, and in the event that the project departs from the original plan or other difficulties arise, work with the grantee to address and resolve the shortcomings, seeking the advice and guidance of the Project Manager and Project Specialist as necessary;Continuously monitor grantee performance and alert the Project Manager at the earliest possible of any existing or possible unsatisfactory grantee performance;Work with the M&E Specialist and ensure preparation of a baseline report at the start of the grant implementation and end-line impact reports for each of the contracted grantees that will complete their contractual obligations and conclude all the milestones;Contribute to the presentations on progress during monthly meetings and other scheduled meetings including Project Technical and Steering Committee meetings organized with the funding partners and other stakeholders.Financial Access and PartnershipsLead engagement with financial service providers to facilitate access to finance for project beneficiaries;Design and implement financial solutions tailored to the needs of FOs and MSMEs, including e.g. blended finance mechanisms and risk-sharing approaches;Build strategic partnerships with banks, microfinance institutions, and other funding entities to enhance financing opportunities and technical assistance for the UCHI Project;Advocate for financial products that align with the commercialization needs of FOs and MSMEs;Research and facilitate development of other relevant financial instruments that would be relevant for the UCHI Project and advise the project team as appropriate;Advise FOs and SMEs with grants on how climate-smart agriculture practices can be integrated in FOs/SMEs agricultural commercialization for maximum impact and achievement of project objectives.Financial Literacy and Capacity BuildingDevelop and oversee the financial literacy training program, ensuring beneficiaries gain essential financial management skills;Support the implementation of other relevant capacity-building initiatives to enhance financial planning, investment readiness, and business sustainability;In collaboration with other actors including financial institutions, provide ongoing technical expertise to project beneficiaries on innovative financing, financial and grant management skills, and business development and management strategies;Where applicable, support the Business Development Specialist in offering business advisory services to grantees, including assistance with business planning, market access, and scaling up their operations;Facilitate knowledge-sharing and learning among grantees;Strengthen financial management and record-keeping systems for grant recipients;Provide technical assistance to Fos and MSMEs to ensure proper budgeting and financial sustainability.The incumbent performs other duties within their functional profile as deemed necessary for the efficient functioning of the Office and the Organization.Institutional ArrangementThe Financing Specialist will be based at the UNDP Malawi’s UCHI – Agriculture Commercialization Project Office in Lilongwe, with frequent in-country travel to support grantees in various districts. The Specialist will report to the UCHI Project Manager, and work in close collaboration with the UCHI Project Specialist and other relevant Project staff. The role will also require regular interaction with external stakeholders, including grantees, financial institutions, other UCHI implementing partners and the donor. CompetenciesCOREAchieve Results: LEVEL 3: Set and align challenging, achievable objectives for multiple projects, have lasting impactThink Innovatively: LEVEL 3: Proactively mitigate potential risks, develop new ideas to solve complex problemsLearn Continuously: LEVEL 3: Create and act on opportunities to expand horizons, diversify experiencesAdapt with Agility: LEVEL 3: Proactively initiate and champion change, manage multiple competing demandsAct with Determination:  LEVEL 3: Think beyond immediate task/barriers and take action to achieve greater resultsEngage and Partner: LEVEL 3: Political savvy, navigate complex landscape, champion inter-agency collaborationEnable Diversity and Inclusion: LEVEL 3: Appreciate benefits of diverse workforce and champion inclusivity Cross functional & Technical competencies Business Direction & Strategy: Strategic Thinking    Ability to develop effective strategies and prioritized plans in line with UNDP’s objectives, based on the systemic analysis of challenges, potential risks and opportunities; linking the vision to reality on the ground, and creating tangible solutions;Ability to leverage learning from a variety of sources to anticipate and respond to future trends; to demonstrate foresight in order to model what future developments and possible ways forward look like for UNDP.Business Direction & Strategy: System Thinking Ability to use objective problem analysis and judgement to understand how interrelated elements coexist within an overall process or system, and to consider how altering one element can impact on other parts of the systemBusiness Development: Knowledge FacilitationAbility to animate individuals and communities of contributors to participate and share, particularly externallyBusiness Management: Project Management  Ability to plan, organize, prioritize, and control resources, procedures, and protocols to achieve specific goals.Business Management : CommunicationAbility to communicate in a clear, concise, and unambiguous manner both through written and verbal communication; to tailor messages and choose communication methods depending on the audienceAbility to manage communications internally and externally, through media, social media, and other appropriate channelsPartnership Management: Relationship ManagementAbility to engage with a wide range of public and private partners, build, sustain and/or strengthen working relations, trust, and mutual understanding Required Skills and ExperienceEducation:Master’s degree in Economics, Development Studies, Accounting or related field.A first-level university degree (bachelor’s degree) in combination with an additional two years of qualifying experience will be given due consideration in lieu of the advanced university degree.Experience:Minimum 7  years (with master’s degree) or  9 years (with bachelor’s degree) of relevant experience in providing financial management advisory services, and/or managing staff and operational systems is required.Required SkillsExperience in the use of computers and office software packages (MS Word, Excel, etc.), and advanced knowledge of web-based management systems such as ERP financials;Experience in Programme/Project management and good communication skills;Desired SkillsExperience in management of grant portfolio, matching grant schemes, impact investing, blended finance mechanisms and/or venture capital vehicles;Experience with enterprise and/or Innovation Challenge Fund management services for private and international organizations;Sector knowledge in agriculture and financial innovation including an up to date understanding of market access frontiers for FOs/SMEs and how they may be shifted through small scale agricultural commercialization;Proven experience working on financing for private sector-driven agriculture development working in Africa context. Experience with Malawi is an added advantage;Strong ability to assess business models, financial sustainability, and risk mitigation strategies;Experience in working with UN Agencies or International Organizations would be an advantage.Required LanguageFluency in  English is required.Equal opportunityAs an equal opportunity employer, UNDP values diversity as an expression of the multiplicity of nations and cultures where we operate and, as such, we encourage qualified applicants from all backgrounds to apply for roles in the organization. Our employment decisions are based on merit and suitability for the role, without discrimination.UNDP is also committed to creating an inclusive workplace where all personnel are empowered to contribute to our mission, are valued, can thrive, and benefit from career opportunities that are open to all.Sexual harassment, exploitation, and abuse of authorityUNDP does not tolerate harassment, sexual harassment, exploitation, discrimination and abuse of authority. All selected candidates, therefore, undergo relevant checks and are expected to adhere to the respective standards and principles.Right to select multiple candidatesUNDP reserves the right to select one or more candidates from this vacancy announcement.  We may also retain applications and consider candidates applying to this post for other similar positions with UNDP at the same grade level and with similar job description, experience and educational requirements.Scam alertUNDP does not charge a fee at any stage of its recruitment process. For further information, please see www.undp.org/scam-alert."
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/Corporate-Graphics-Malawi.jpeg",
    "companyName": "Corporate Graphics Malawi",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Internship",
    "link": "https://jobsearchmalawi.com/job/digital-marketing-intern/",
    "location": "Blantyre",
    "position": "Digital Marketing Intern Corporate Graphics Malawi",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "Join Our Creative Team as a Digital Marketing Intern!Are you curious about how great ideas come to life online? Do you want to learn how top agencies deliver high-impact digital campaigns, not just create them? Corporate Graphics is on the hunt for a Digital Marketing Intern to support our Creative Department in bringing bold ideas to life online. This is a hands-on, behind-the-scenes role perfect for someone organised, digitally curious, and ready to learn the inner workings of great execution. No content creation required to start — just a sharp eye and a steady hand.What you will be doingScheduling approved content on platforms like Instagram, Facebook, LinkedIn and TikTokKeeping post calendars updated and deadlines metMonitor and respond to comments, messages, and tags across platformsMaking sure our creative work shows up correctly — on time, every timeSupporting the creative team with admin and basic digital opsLearning how campaigns are managed from studio to screenWhat we are looking forReliable and detail-orientedDigitally aware and curious about the creative and digital worldComfortable using Google Docs/Sheets and social media toolsA team player with a good attitudeInternship Duration: 3–6 monthsEmployment Type: Part-timeLocation: BlantyreTo Apply: Fill out the form on the link below by Monday, 16th June 2025.https://forms.gle/GP9gPGfpUQro2Nu47"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/UNDP-150x150.png",
    "companyName": "UNDP",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/?post_type=job_listing&p=517",
    "location": "Lilongwe",
    "position": "Gender Officer UNDP",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "Job DescriptionBackgroundSince 1964, UNDP has been active in Malawi, aiding the Government in its development agenda by supporting policies, establishing partnerships, and enhancing institutional capacities to achieve national development goals and the Sustainable Development Goals (SDGs). The UNDP Malawi’s Country Programme Document (CPD) for 2024-2028 aligns with the Malawi Vision 2063 and its first 10-Year Implementation Plan, aiming to support Malawi in meeting the SDGs by 2030. This comprehensive programme addresses the interconnected challenges of poverty, inequality, and vulnerability to shocks, organized within two principal portfolios:Governance: This portfolio focuses on strengthening effective, accountable, and inclusive governance. It promotes civic engagement, human rights, the rule of law, peace, and democracy, alongside improving data generation and analysis.Resilience and Sustainable Growth (RSG): This portfolio focuses on economic innovation, inclusive business, job creation, and renewable energy access. It also aims to help Malawi adapt to climate change and build resilience to disasters. Resilience and Sustainable Growth (RSG) PortfolioThe RSG Portfolio adopts a multifaceted approach combining inclusive growth, sustainability, climate adaptation, resilience to shocks, and agricultural development. It integrates natural resource management, poverty-environment linkages, disaster risk management, and agricultural value chain commercialization. The portfolio engages a broad range of stakeholders, including government entities, development partners, and multilateral agencies. UNDP’s resilience programming within the RSG Portfolio specifically targets the mitigation of threats, risks, and impacts of climate change and related economic and social shocks. The RSG Portfolio also includes a dynamic private sector development programme that employs various de-risking financial instruments to support private sector investments in the country. This programme is designed to assist entrepreneurs at every stage of their journey, from business incubation to acceleration and growth across different economic sectors.The resilience programming takes a holistic approach, addressing interconnected issues such as governance, public services, inclusive economic opportunities, natural resource management, and agricultural development. The primary outcomes target enhancing socio-economic resilience, equitable access to economic opportunities, sustainable natural resource management, and increased agricultural productivity and income for smallholder farmers. This is achieved through collaboration with diverse stakeholders, including government, UN partners, civil society, the private sector, and academia.Agriculture and Commercialization Agriculture is the backbone of Malawi’s economy, employing over 70% of the population and significantly contributing to the country’s Gross Domestic Product (GDP) at 24.7%. While subsistence farming has predominated, there is a growing emphasis on commercialization to unlock the sector’s full potential. This transition from traditional, subsistence-oriented farming to market-oriented, profit-driven activities aligns with the Government’s Agriculture, Tourism, and Mining (ATM) growth strategy. This shift is crucial for enhancing food security, increasing farmers’ incomes, promoting rural development, and achieving broader economic growth objectives. Achieving meaningful commercialization requires targeted interventions, supportive policies, and a solid anchorage for the private sector. Since 2014, UNDP has actively supported the private sector in advancing sustainable development through diverse initiatives and partnerships in agriculture, collaborating closely with mainstream Government Ministries, Departments, and Agencies (MDAs).Through collaboration with private sector entities and leveraging relevant past experiences, the UCHI Strengthening Agricultural Commercialization Project will provide the technical expertise, resources, and networks necessary to tackle challenges related to agricultural commercialization and generate market and financial opportunities for smallholder farmers (SHFs). The project advocates market-oriented business practices and stimulates market and financial opportunities within priority value chains.Despite agriculture’s economic significance, gender disparities persist, limiting women’s participation in commercial farming and agribusiness. It is on this note that UNDP is seeking to acquire the services of a Gender Specialist who will ensure the UCHI Agriculture Commercialization Project adopts a gender-responsive approach, empowering women and marginalized groups.The Gender Officer will provide technical expertise to integrate gender across all UCHI Agriculture Commercialization project outputs. The incumbent will work closely with project staff, government institutions, project donors and the FOs/SMEs to promote gender equality, women’s empowerment, and inclusive economic participation in the project’s agricultural commercialization efforts. Duties and ResponsibilitiesEffective Gender Mainstreaming into the Project Develop gender mainstreaming tools, including training guidelines and Key Performance Indicators (KPIs) for gender-responsive performance management within the UCHI Agriculture Commercialization Project;Conduct gender analysis to identify gender disparities and opportunities in the target value chains and communities;Based on the analysis, design and implement a responsive gender action plan tailored for the UCHI Agriculture Commercialization project aligned to project objectives;Provide substantive oversight of the project’s activities ensuring gender mainstreaming at all levels of the project including financial, procurement and administrative processes;Identify strategic actions as necessary, to be undertaken to improve the quality of implementation, support achievement of related results, and manage the effective application of the project’s Gender Marker;Advise the project team on opportunities for women economic empowerment including but not limited to income generating activities, financial inclusion, governance training, etc.;Introduce gender capacity building targeting both men and women; and promote men’s active role as champions of change towards equality at HH, FO and community levels;Introduce innovative gender mainstreaming tools including the Gender Action Learning Systems – GALS.Monitoring and ReportingProvide technical advice on integrating gender considerations into project monitoring, evaluation, and learning (MEL) frameworks;Prepare periodic reports on gender integration, progress and impact within the project;Provide advice on appropriate gender sensitive indicators across the project and support the project team in the monitoring and reporting of results/outputs and objectives against agreed indicators, in close collaboration with the UCHI Agriculture Commercialization Project’s Monitoring, Evaluation and Learning Specialist;Provide substantive inputs into all reports (semi-annual, annual and donor reports) to ensure they are gender sensitive and have included all required gender considerations;Introduce a community feedback mechanism to give room to project beneficiaries to report any forms of misconduct, sexual exploitation and abuse; and provide feedback on project implementation.Knowledge Building and Advocacy Ensure that all UCHI Agriculture Commercialization Project staff and beneficiaries are equipped to sustain mainstreaming gender equality objectives/goals in their respective areas of work;Maintain relationships with UCHI partners including other UN agencies, donors, and government agencies on matters related to the promotion of national commitments to gender equality with a view of ensuring strategic partnerships and strengthening collaboration in the implementation of the gender action plan within the UCHI Agriculture Commercialization Project;Consolidate gender lessons learned and recommendations for dialogue, advocacy, and future programming, and organize dissemination of learning with key project partners;Contribute to knowledge networks and communities of practice where good practices in terms of gender mainstreaming are showcased. The incumbent performs other duties within their functional profile as deemed necessary for the efficient functioning of the Office and the Organization. Institutional ArrangementThe Gender Officer will be based at the UNDP Malawi’s UCHI – Agriculture Commercialization Project Office in Lilongwe, with in-country travel to various districts as required. The Gender Officer will report to the UCHI Project Manager, and work in close collaboration with other relevant project staff. CompetenciesCOREAchieve Results: LEVEL 1: Plans and monitors own work, pays attention to details, delivers quality work by deadlineThink Innovatively: LEVEL 1: Open to creative ideas/known risks, is pragmatic problem solver, makes improvementsLearn Continuously: LEVEL 1: Open minded and curious, shares knowledge, learns from mistakes, asks for feedbackAdapt with Agility: LEVEL 1: Adapts to change, constructively handles ambiguity/uncertainty, is flexibleAct with Determination:  LEVEL 1: Shows drive and motivation, able to deliver calmly in face of adversity, confidentEngage and Partner: LEVEL 1: Demonstrates compassion/understanding towards others, forms positive relationshipsEnable Diversity and Inclusion: LEVEL 1: Appreciate/respect differences, aware of unconscious bias, confront discrimination Cross-Functional & Technical competenciesBusiness Management: CommunicationAbility to communicate in a clear, concise, and unambiguous manner both through written and verbal communication; to tailor messages and chose communication methods depending on the audience.Ability to manage communications internally and externally, through media, social media, and other appropriate channels.Business Development: Knowledge facilitationAbility to animate individuals and communities of contributors to participate and share, particularly externally.Business Direction & Strategy  Effective Decision MakingAbility to take decisions in a timely and efficient manner in line with one’s authority, area of expertise and resources.Business Direction & Strategy  Negotiate and influenceAbility to reach an understanding, persuade others, resolve points of difference, gain advantage in the outcome of dialogue, negotiates mutually acceptable solutions through compromise and creates “win-win” situations.2030 Agenda: PeopleGender mainstreaming Required Skills and ExperienceEducation:Advanced university degree (master’s degree or equivalent) in Gender Studies, Development Studies, Social Sciences or relevant related fields is required ORA first-level university degree (bachelor’s degree) in a relevant field in combination with an additional two years of qualifying experience will be given due consideration in lieu of the advanced university degree.Experience:Applicants with Master’s degree (or equivalent) in a relevant field of study are not required to have professional work experience. Applicants with a Bachelor’s degree (or equivalent) are required to have a minimum of two (2) years of relevant professional experience in gender mainstreaming, women’s empowerment, and inclusive development.Required SkillsProven experience in conducting gender analyses, designing gender-responsive interventions, and working with farmer organizations and private sector actors.Desired SkillsExperience in agriculture or rural development programs is preferable;Strong understanding of Malawi’s gender policies, rural development frameworks, and international gender equality commitments;Experience in assessing gender barriers at community level and development of tailored interventions to address inequalities and increase women’s power and agency;Experience in gender-related capacity-building, stakeholder engagement, and policy advocacy;Excellent analytical, communication, and report-writing skills.Required LanguagesFluency in English with proficiency in effective written and oral communications is required.Fluency in Chichewa is required.Knowledge of other local languages is an asset. Equal opportunityAs an equal opportunity employer, UNDP values diversity as an expression of the multiplicity of nations and cultures where we operate and, as such, we encourage qualified applicants from all backgrounds to apply for roles in the organization. Our employment decisions are based on merit and suitability for the role, without discrimination.UNDP is also committed to creating an inclusive workplace where all personnel are empowered to contribute to our mission, are valued, can thrive, and benefit from career opportunities that are open to all.Sexual harassment, exploitation, and abuse of authorityUNDP does not tolerate harassment, sexual harassment, exploitation, discrimination and abuse of authority. All selected candidates, therefore, undergo relevant checks and are expected to adhere to the respective standards and principles.Right to select multiple candidatesUNDP reserves the right to select one or more candidates from this vacancy announcement.  We may also retain applications and consider candidates applying to this post for other similar positions with UNDP at the same grade level and with similar job description, experience and educational requirements.Scam alertUNDP does not charge a fee at any stage of its recruitment process. For further information, please see www.undp.org/scam-alert.Required SkillsCommunication SkillsGender Mainstreaming"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/05/Job-Search-Malawi-150x150.png",
    "companyName": "One Stop Community Pharmacy",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/pharmacist/",
    "location": "Blantyre | Lilongwe | Zomba | Mzuzu.",
    "position": "Pharmacist One Stop Community Pharmacy",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "VACANCYPHARMACISTAn opportunity exists for an enthusiastic and well motivated Pharmacist to join the ONESTOP group.You should be an experienced Pharmacist with an excellent track record of Pharmaceutical Services Management either in public or private sector.BUT for those with minimal or no experience in-house training will be provided.Ready to work in any of its retail pharmacy branches:\nBlantyre/Lilongwe/Zomba/Mzuzu.QUALIFICATIONSDegree in Pharmacy and should be registered with PMRAApplications letters and CV’s can be sent to: onestop@globemw.netClosing date: 20th June, 2025."
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/Chemonics-150x150.png",
    "companyName": "Chemonics",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/?post_type=job_listing&p=514",
    "location": "Lilongwe",
    "position": "Subcontracts and Procurement Specialist Chemonics",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "JOB ADVERTISEMENTProject BackgroundThe purpose of the Global Health Supply Chain (GHSC) program – Procurement and Supply Management (PSM) project is to ensure the uninterrupted supply of health commodities in support of USG-funded public health initiatives around the world. The project provides direct procurement and supply chain management support to the President’s Emergency Plan for AIDS Relief (PEPFAR) and the President’s Malaria Initiative (PMI). In supporting USG-funded global health activities, PSM will develop and manage a wide array of services for health commodity procurement and related systems strengthening technical assistance encompassing different elements of a comprehensive supply chain.At the country level, GHSC-PSM supports country strategies and priorities that fall under the following three project objectives:Global Commodity Procurement and Operational SupportSystems SupportGlobal Collaboration to Improve Long-Term Availability of Health Commodities.Application InstructionsAn application letter, a full detailed Curriculum Vitae or Resume with three traceable referees should be sent to: psmmalawirecruit@gmail.com. Applications are due by Close of business, Friday, June 13, 2025. Only short-listed candidates will be contacted.We are currently seeking qualified professionals for the following position:JOB TITLE: Subcontracts and Procurement SpecialistJOB LOCATION:Lilongwe, MalawiREPORTS TO:The Operations and Procurement ManagerPosition SumayThe Subcontracts and Procurement Specialist is responsible for the management of subcontracts and procurement for all non- pharmaceutical commodities and services required for GHSC-PSM program operations in Malawi. This individual will be responsible for general subcontracts and leases management, preparation of procurement planning, procurement execution, proposal review, vendor selection, and the negotiation and management of awards.Principal Duties and ResponsibilitiesRespond in a timely manner to procurement requests from project staff, including accepting and reviewing procurement action requests forms and working with project staff for clarifications, as needed.Prepare draft RFPs and RFQs for solicitation of proposals and quotations or work directly with local vendors to obtain quotations and initiate procurements.Negotiate and prepare contracts and purchase orders.Ensure that procurement activities are carried out in accordance with contractual requirements, including US Federal Acquisition Regulations (FAR)Coordinate bid evaluation and prepare summary reports for review and approval.Monitor subcontracts and purchase orders issued to vendors and follow-up as necessary to ensure compliance with terms and conditions.Provide regular status reports to the Operations and Procurement Manager and other field staff.Support the creation, negotiation, and management of subcontracts through the contract life-cycle, including drafting subcontracts, modifications, negotiation memorandums, and other associated documents.Maintain the overall integrity of the subcontracts and procurement filing system by ensuring that appropriate documentation is included in each procurement file in accordance with the project’s filing policy.Maintain a detailed and updated pre-qualified list of vendorsSupport the Operations and Procurement Manager in maintaining updated procurements and subcontracts trackersProvide procurement status reports as requestedQualificationsMust be highly organized, detail oriented, and knowledgeable in USAID or US Department of State procurement regulations.This post requires a person with at least a Bachelor’s Degree in Business Administration, Procurement, Supply Chain Management, or related field.At least 5 total years of experience working in procurement and or/subcontracts management preferably organizations funded by USAID or US Department of State.Must possess valid professional registration with Malawi Institute of Procurement & Supply – MIPS.Level of Effort\nThis is a long term position.\nGlobalQMS ID: 2079.11, 26 October 2017"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/Seibo_Logo-150x150.png",
    "companyName": "Seibo Maria",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/school-feeding-officer/",
    "location": "Mzimba",
    "position": "School Feeding Officer Seibo Maria",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "VACANCY ANNOUNCEMENT Seibo Maria is a Not-For-Profit Organization with a purpose to provide school meals in partnership with local communities. Our goal is to feed every hungry child in the world a hot meal in school. Currently we work in 2 districts: Mzimba boma in 12 Primary schools and Blantyre in 1 Primary school and 45 Nursery schools all within Chilomoni area. We are inviting applications from suitably qualified and experienced candidates for the following position: ___________________________________________________________________________SCHOOL FEEDING OFFICER (Permanent, Full-Time)Location : Mzimba Reporting to: Program Manager___________________________________________________________________________KEY RESPONSIBILITIESConducting daily school visits to monitor daily usage of Likuni Phala, proper recording, proper storage of stock and equipment, and enforcing adherence to standard operating procedures including hygiene.Collect and submit school data such as attendance, enrolment and number of meals fed to assist in measuring program indicators and in ordering Likuni Phala for targeted schoolsConduct coaching, mentoring and training schools and communities in technicalities of cooking porridge (cooking demonstrations), data management and general participation in the school feeding programEnsure full functionality of school Health & Nutrition (SHN) Committees, mobilize schools and communities to revamp weak SHN Committees for smooth running of the programOrganize regular community meetings and stakeholder meetings to resolve various challenges facing the school feeding programAssist in planning and delivery of training sessions to the community and program staffCompiling and submitting weekly data and program updatesCompiling and submitting monthly data and reportsAssist in capturing photos and videos  Assist in compiling success storiesAssist in program fundraising activitiesAny other duties as assigned by management from time to time. QUALIFICATIONS AND EXPERIENCE: Degree in Education, ECD, Nutrition, Community Development/Social work, Public Health, or other related programsAt least 2 years’ experience in NGOs, working directly with schools and communitiesProven skills in extension work, with daily engagement and training of rural communities on community program issues including facilitation of meetings.Experience working in education programs in collaboration with schools, communities, DEM’s Office and district technical working groupsDemonstrable proficient with Microsoft applications such as Excel, Word, Outlook, Teams, PowerPoint, and SharePoint.Demonstrable experience with various data collection tools and techniques (quantitative and qualitative)Proactive problem solver who is collaborative, dedicated, organized, and communicates wellKnowledge of Child-safeguarding MUST HAVE a Valid Motorbike License with practical riding experience for remote hilly terrains (Those without a motorbike license need not apply)WHAT WE OFFER: A School Feeding Officer role contributing to high impact child nutritionA chance to grow professionally within a purpose-driven organizationFair and competitive compensation”An opportunity to support the health and nutrition of thousands of childrenInterested and eligible applicants should submit their application via email, including a CV with at least two traceable referees, a cover letter, a copy of a valid motorbike license, and relevant certificates. Applications should be sent to:\ninfo@seibomaria.org Addressed to: The Human Resources & Administration OfficerSeibo MariaP.O. Box 3150Blantyre.Application Deadline is Friday 19th June 2025"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/05/Job-Search-Malawi-150x150.png",
    "companyName": "Diplomats Car Hire",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/airport-receptionist/",
    "location": "Blantyre",
    "position": "Airport Receptionist Diplomats Car Hire",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "JOB VACANCYJob Title: Airport ReceptionistDiplomats Car HireLocation: Chileka International Airport, BlantyreVacancy Publishing date: 10th June 2025DETAILSVACANCY: AIRPORT RECEPTIONISTLocation: Chileka International Airport, BlantyreDiplomats Car Hire is looking for a smart, confident, and customer-focused individual to join our team as an Airport Receptionist. The successful candidate will be the first point of contact for our esteemed clients at the airport, playing a key role in ensuring a seamless and professional customer experience.Key Responsibilities:Greet and welcome clients arriving at the airport.Assist clients with check-in and car hire documentation.Keep accurate records of arrivals, bookings, and vehicle allocations.Coordinate with operations and drivers for timely pick-ups and drop-offs.Handle customer inquiries and complaints professionally.Maintain a clean, organized, and presentable reception area at all times.Qualifications & Requirements:Diploma in Hospitality Management, Tourism, or any related field.Experience in a customer service or receptionist roleExcellent communication and interpersonal skills.Ability to multitask and remain calm under pressure.Basic computer literacy (Microsoft Office, Email).Willing to work flexible shifts, including weekends and public holidays.Valid Driver’s License is required.How to Apply:Interested candidates should submit their CV and cover letter addressed to:The Deputy Managing DirectorDiplomats Car HireEmail: jobs@diplomatscarhire.comApplication Deadline: 15th June 2025"
  },
  {
    "applicationDeadline": "N/A",
    "companyLogo": "https://jobsearchmalawi.com/wp-content/uploads/2025/06/Eris-Properties.webp",
    "companyName": "Eris Properties Mw Limited",
    "datePosted": "2025-06-11",
    "isValidUrl": true,
    "jobType": "Full Time",
    "link": "https://jobsearchmalawi.com/job/accounting-associate/",
    "location": "Blantyre",
    "position": "Accounting Associate Eris Properties Mw Limited",
    "scrapedAt": "2025-06-15T10:12:36.222Z",
    "source": "jobsearchmalawi",
    "jobDescription": "ACCOUNTING ASSOCIATEEris Properties (Mw) Limited, one of the leading Real Estate Services Companies and a member of the NICO Group, invites applications from suitably qualified individuals to fill the position of Accounting AssociateJOB FUNCTIONAssisting in managing and controlling accounting activities of the finance section of the company.DESCRIPTION OF DUTIESPreparing payment vouchers in a timely manner and ensure they are accurately filed with supporting documentsCollecting receipts for all payments madeAssisting with preparation of tax returnsMaking timely payment of all taxes and leviesAssisting with billing invoices and collection of receivablesTimely and orderly filing of documentsCapturing entries to appropriate supplier and customer ledgersCapturing cash book transactions on a weekly basisPreparing weekly and monthly bank reconciliationsPreparing the daily cash balances reportPreparing various other reconciliations including tax, fixed deposit control account reconciliationsEnsuring that all excess funds are invested in accordance with company policiesArranging and accounting for petty cash disbursementsPromptly resolving customer queriesPreparing expenses reportsCapturing Journal entriesAssisting with preparation of audit schedulesAny other duties assigned from time to timeREPORTINGThe Accounting Associate will report to the Assistant Accountant.QUALIFICATIONSBachelor’s degree in accountancyProficient in Microsoft Office applications, particularly Excel and other spreadsheet tools.Strong attention to detail with a high level of accuracy in data entry and financial analysis.At least 1 year of experience in accounting, bookkeeping, or a related field (preferred but not required).Strong organizational and time management skills.Effective written and verbal communication skills.Ability to work independently and collaboratively in a fast-paced environment.Knowledge of SAGE 300 ERP -ACCPAC accounting systems is a plus.Interested candidates, who meet the above requirements, should send their Curriculum Vitae with three traceable referees and a covering letter through email only:The Chief Executive Officer\nEris Properties Mw Limited\nBLANTYRE\ne-mail: recruitment@eris.co.mwThe Closing date for receiving applications is on the 16th June 2025."
  }
]